{
   "data" : {
      "userid" : {
         "name" : "Peter Tschipper",
         "id" : "SPIRITSKY"
      },
      "description" : "guaranteed message delivery system",
      "communities" : "newsgroups",
      "chapterid" : {
         "name" : "Networking_Devices_IPC",
         "id" : "5"
      },
      "similar" : "",
      "DSLIP" : "bdpOp",
      "modid" : "Net::MsgQ",
      "enteredon" : "Wed Feb  6 19:54:17 2002 GMT",
      "enteredby" : {
         "name" : "Peter Tschipper",
         "id" : "SPIRITSKY"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "MsgQ is a guaranteed message delivery system that is based on Send\n    and Recieve queues. It's very easy for administrators to setup the\n    queues and collect data from various sources around the network and\n    generate on the fly web pages using CGI. Although the system was\n    originally designed for administrators there are no doubt other\n    applications that could benefit from a system that guarantees the\n    delivery of one and only one message. One unique thing about the\n    send queues is their ability to read from messages from an incoming\n    socket, as would be the case with a telephone switch that has \"data\n    steps\" programmed into it. I've used this in a production\n    environment and it works great especially since the telephone\n    switches can not open a socket connection to a process that lives in\n    a different domain. In a case like this all you have to do is setup\n    the send queue in the same domain as the switch and have your\n    receive queue on your web server which may be somewhere across the\n    WAN.\n\n    I think this module either belongs under the Net::MsgQ namespace or\n    needs it's own MsgQ::...I don't see it belonging anywhere else\n    unless you have other ideas...\n\n    Thanks ....Peter Tschipper"
   },
   "meta" : {
      "message_id" : "200202061954.UAA14198@pause.perl.org",
      "epoch" : 1013025261,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission Net::MsgQ",
      "file" : "10034.txt",
      "type" : "module_submission"
   }
}
