{
   "data" : {
      "userid" : {
         "name" : "Steven Lembark",
         "id" : "LEMBARK"
      },
      "description" : "Parallel execution w/ dependencies.",
      "Schedule:" : "seems likely since this runs other jobs.",
      "communities" : "",
      "chapterid" : {
         "name" : "Operating_System_Interfaces",
         "id" : "4"
      },
      "similar" : "Similar to pmake, not much else I can find.",
      "DSLIP" : "adpOp",
      "modid" : "Schedule::Depend",
      "enteredon" : "Thu Feb  7 00:14:09 2002 GMT",
      "enteredby" : {
         "name" : "Steven Lembark",
         "id" : "LEMBARK"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Schedule:: seems likely since this runs other jobs.\n\n    Schedule::Depend is an OO variant of a makefile system for running\n\n    tasks that depend on one another sequentially, can run in parallel\n\n    and/or may have to be restarted after a general failure. It\n    combines\n\n    a simplified make-like syntax with the ability to overload token\n\n    expansion and pre-post execution checks and the use of pidfiles\n\n    with exit status that allow restarting the queue.\n\n    The syntax of its dependncy list is similar to make. Rather than\n\n    try to emulate make's target + exectuion format, however, this\n\n    uses literal aliases as the baseline replacement, e.g.,\n\n    bar = pwd\n\n    foo = ls\n\n    foo:bar\n\n    will run \"ls\" after \"pwd\". Overloading the alias mechanism allows\n    replacing \"foo\" with whatever the designer likes.\n\n    The runnable jobs are forked, with the expanded string fed to the\n    shell via exec $string; children are reaped via wait. Jobs are run\n    in parallel, within limits set by a maxjob parameter in the alias\n    list.\n\n    The code itself is reasonably stable at this point, main reason for\n    marking it \"alpha\" are likely changes in the interface as people\n    play with it."
   },
   "meta" : {
      "message_id" : "200202070014.BAA16253@pause.perl.org",
      "epoch" : 1013040849,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission Schedule::Depend",
      "file" : "10039.txt",
      "type" : "module_submission"
   }
}
