{
   "data" : {
      "userid" : {
         "name" : "Benjamin R. Ginter",
         "id" : "BRG"
      },
      "description" : "Access MPEG bitstream information and data.",
      "communities" : "http://1-up.net:81/mailman/listinfo/perl-video",
      "chapterid" : {
         "name" : "Images_Pixmaps_Bitmaps",
         "id" : "18"
      },
      "similar" : "MPEG::Info RIFF::Info ASF::Info Video::Info",
      "DSLIP" : "amhOo",
      "modid" : "MPEG",
      "enteredon" : "Mon Mar  4 23:41:44 2002 GMT",
      "enteredby" : {
         "name" : "Benjamin R. Ginter",
         "id" : "BRG"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "I am the author of MPEG::Info and I originally took a \"Perl parses\n    the bitstream\" approach to accessing MPEG information. However, the\n    lack of open access to the MPEG specs combined with the complexity\n    of the standards has made creating a robust implementation\n    difficult.\n\n    Last week, I successfully completed a SWIG-based wrapper to\n    libmpeg3. With this module, it is possible to extract information\n    and data from the following file formats quickly and reliably:\n\n    MPEG-1 Layer II Audio MPEG-1 Layer III Audio MPEG-2 Layer III Audio\n    MPEG-1 program streams MPEG-2 program streams MPEG-2 transport\n    streams AC3 Audio MPEG-2 Video MPEG-1 Video IFO files VOB files\n\n    The decision where this module should live has been a nagging\n    question as I've continued development. Allen Day and I have been\n    collaborating on Perl video modules and have been discussing the\n    fate of this new MPEG module.\n\n    I would like to see a top-level MPEG.pm that provides a simple\n    interface to accessing MPEG bitstream parameters and data. However,\n    I don't want to see this top-level module rely on a single backend\n    implementation. What if libmpeg3 is no longer maintained or another\n    library proves superior?\n\n    So the current thought is that the SWIG-wrapped libmpeg3 would live\n    in a module named MPEG::LibMPEG3. A currently completely\n    hypothetical top-level MPEG.pm could provide a consistant interface\n    to this libmpeg3 library or one of many others, provided that each\n    MPEG decoder module adhered to a pseudo-standard with regard to\n    method names.\n\n    MPEG::Info will be updated and become a \"stub\" module, relaying the\n    function calls to the main MPEG module.\n\n    There is currently a Video namespace but the trend thus far has\n    been to create a top-level namespace for each moving picture format.\n    The term Video really doesn't fit for codecs that handle both audio\n    and video. Perhaps a Movie or Multimedia would be better?\n\n    We're a little unsure how to proceed here and need some input. Soon\n    Perl will have some fairly nice video modules that have been lacking\n    for some time. It would be a Good Thing to make them consistant.\n\n    Thanks for your help!\n\n    Benjamin R. Ginter"
   },
   "meta" : {
      "message_id" : "200203042341.AAA10966@pause.perl.org",
      "epoch" : 1015285305,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission MPEG",
      "file" : "10456.txt",
      "type" : "module_submission"
   }
}
