{
   "data" : {
      "userid" : {
         "name" : "Rational Software",
         "id" : "RATL"
      },
      "description" : "Rational ClearCase Interface",
      "communities" : "ClearCase International Users' Group; cciug@rational.com",
      "chapterid" : {
         "name" : "Commercial_Software_Interfaces",
         "id" : "24"
      },
      "similar" : "ClearCase::Argv IPC::ClearTool",
      "DSLIP" : "RdhOo",
      "modid" : "CtCmd",
      "enteredon" : "Tue Mar 19 20:18:53 2002 GMT",
      "enteredby" : {
         "name" : "Rational Software",
         "id" : "RATL"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "CtCmd bcause \"ct\" is the commonly used alias for \"cleartool\", which\n    is too difficult to type.\n\n    Since the module requires a shared object built against previously\n    installed Rational product, it is not compatible with with or\n    related to the two modules above, although David Boyce that he has\n    created new versions of the above modules that will be able to\n    invoke CtCmd.\n\n    We would like to distribute with the Common Public License v0.5.\n\n    Following is a copy of some email between me and Jarkko from last\n    summer:\n\n    > > Dear Jarkko, > > > > For the past several months my colleagues\n    and I have been testing a Perl > > module implementing a simple,\n    efficient interface into our product, > > ClearCase. > > > > We\n    would like to contribute CtCmd to CPAN and wonder if this would be >\n    > possible. > > > > If you agree, we would like to submit CtCmd in\n    October, 2001. > > > > CtCmd has been built, installed and tested on\n    Solaris 2.7 and 2.8, HPUX > > 10.20 and 11.0, RH Linux 6.2 and Win32\n    - NT 4.0 and 5.0. > > > > ClearCase must be available on a machine\n    where CtCmd is to be built, as some > > 57 ClearCase shared\n    libraries are linked to CtCmd.so during the build > > process. > > >\n    > Please let me know what you think. > > Sounds good to me. > >\n    Though-- the name CtCmd is not ideal (according to the usual module\n    > naming practices, a two-level name is usually better, the first\n    part > telling the general category). But if the naming convention >\n    CtSomething is well-recognized in the ClearCase community, I guess >\n    it's kind of an okay name.\n\n    Also, just to be absolutely clear: the only kind of software\n    allowed in CPAN is software covered under any of the the\n    OSI-approved \"free\" licenses (http://www.opensource.org/ ). I'm\n    certain you are fully aware of this, but I'm just being real\n    cautious when getting email from a commercial software company...\n    please acknowledge whether you do want the CPAN account for the\n    CtCmd."
   },
   "meta" : {
      "message_id" : "200203192018.VAA26264@pause.perl.org",
      "epoch" : 1016569133,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission CtCmd",
      "file" : "10722.txt",
      "type" : "module_submission"
   }
}
