{
   "data" : {
      "userid" : {
         "name" : "mock",
         "id" : "MOCK"
      },
      "description" : "Interface to PayPal",
      "communities" : "",
      "chapterid" : {
         "name" : "World_Wide_Web_HTML_HTTP_CGI",
         "id" : "15"
      },
      "similar" : "Business::OnlinePayment",
      "DSLIP" : "bdpOp",
      "modid" : "Business::PayPal",
      "enteredon" : "Tue Mar 26 17:55:22 2002 GMT",
      "enteredby" : {
         "name" : "mock",
         "id" : "MOCK"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "PayPal works a bit differently than standard credit card\n    transactions. Instead of contacting the payment server and verifying\n    that a credit card can be charged, PayPal users are forwarded to the\n    PayPal site (www.paypal.com) and then sent back to the site from\n    which they came. Verification that payment occured is posted back to\n    a special Instant Payment Notification URL separately by the PayPal\n    server (www.paypal.com).\n\n    Now that the background is out of the way, my module allows one to\n    build PayPal buttons that contain an indentifier (a session) which\n    is passed back to one's site when the purchaser returns so that\n    their session can be resumed. It also handles the validation of the\n    Instant Payment Notification in a secure manner (even checking if\n    the ssl certificate returned by www.paypal.com is correct). This\n    allows one to build CGI payment forms with PayPal buttons to sell\n    things such as software, or in my case, conference registrations and\n    instantly determine if the customer has payed or not, and thus give\n    imediate feedback to the customer.\n\n    I believe that Business::PayPal is the best namespace choice. While\n    the module does do online payment, it doesn't really have any of the\n    same fundamental structures as a typical credit card payment module\n    has, so it doesn't really fit under the Business::OnlinePayment\n    hierarchy. To my knowledge, there are no other modules for handling\n    PayPal transactions currently in CPAN."
   },
   "meta" : {
      "message_id" : "200203261755.SAA26876@pause.perl.org",
      "epoch" : 1017165322,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission Business::PayPal",
      "file" : "10853.txt",
      "type" : "module_submission"
   }
}
