{
   "data" : {
      "userid" : {
         "name" : "Dr. James Freeman",
         "id" : "JFREEMAN"
      },
      "description" : "CGI::Simple - Drop in replacement for CGI.pm",
      "communities" : "perlmonks.org",
      "chapterid" : {
         "name" : "World_Wide_Web_HTML_HTTP_CGI",
         "id" : "15"
      },
      "similar" : "CGI.pm et al",
      "DSLIP" : "RdpOp",
      "modid" : "CGI::Simple",
      "enteredon" : "Fri Apr 12 01:17:22 2002 GMT",
      "enteredby" : {
         "name" : "Dr. James Freeman",
         "id" : "JFREEMAN"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "CGI.pm is the Perl standard for CGI parameter parsing. A number of\n    criticisms are regularly aired about this module ranging from its\n    large size, 'eclectic' internal structure and arbitrary inclusion of\n    HTML generation which is not used or favoured by a significant\n    percentage of users.\n\n    Its strengths include an excellent interface, extensive\n    documentation and its extended real world testing.\n\n    Even the author suggests that this module has become monolithic and\n    convoluted. So - time for a refactoring...\n\n    CGI::Simple provides a relatively lightweight drop in replacement\n    for CGI.pm It is about 1/3 the total size with less than half the\n    default code load. It loads and runs around twice as fast as CGI.pm.\n    It shares an identical OO interface to CGI.pm for parameter parsing,\n    file upload, cookie handling and header generation. It does not\n    provide any methods to generate HTML It provides some new methods\n    and more complete support for cgi-lib It provides improved error\n    handling, especially for file uploads The module is strict and\n    warnings compliant It uses Selfloader to load rarely used methods on\n    demand Main module is entirely object oriented. A complete\n    functional interface is available by using the CGI::Simple::Standard\n    wrapper module. An extensive test suite is included (around 1000\n    tests). CGI.pm methods have changed somewhat across the versions.\n    Concordance testing appears perfect against CGI.pm 2.78."
   },
   "meta" : {
      "message_id" : "200204120117.DAA23013@pause.perl.org",
      "epoch" : 1018574242,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission CGI::Simple",
      "file" : "11134.txt",
      "type" : "module_submission"
   }
}
