{
   "data" : {
      "userid" : {
         "name" : "Lincoln A Baxter",
         "id" : "LBAXTER"
      },
      "subject" : "\"New module which provides Access to HP Openview opcmsg()",
      "Mon:" : "is specific to the software package:",
      "Summary" : "There are other places which contain monitoring software,",
      "description" : "OO and function access to Openview opcmsg()",
      "communities" : "comp.lang.perl.modules",
      "chapterid" : {
         "name" : "Commercial_Software_Interfaces",
         "id" : "24"
      },
      "similar" : "There are other modules that are concerned with system monitoring in\n    various places SNMP/Mon Net::SNMP none of these are good fits for\n    Openview",
      "DSLIP" : "Rdchp",
      "modid" : "Openview::Message",
      "enteredon" : "Fri Apr 26 03:45:40 2002 GMT",
      "enteredby" : {
         "name" : "Lincoln A Baxter",
         "id" : "LBAXTER"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "A discusion of the name space issues for this module was engaged on\n    comp.lang.perl.modules. Reference is made to the discussion with the\n    subject: \"New module which provides Access to HP Openview opcmsg()\n    API\"\n\n    Summary: There are other places which contain monitoring software,\n    but no consistent place, where all monitoring software might be\n    found. Net:: is large, and mostly OSS, or RFC standards related\n    (except for AOL and one or two other packages of wide user\n    acceptance and general user interest.\n\n    In does not belong in SNMP:: and SNMP can be found in several\n    places.\n\n    Mon:: is specific to the software package:\n    http://www.kernel.org/software/mon/\n\n    The weight of existing practice and tradition, makes it hard to\n    come up with a better location than a new TL namespace (Openview::)\n    This package currently contains two modules: the perl XS extension\n    to the Openview opcmsg() API (Openview::Message::opcmsg, and an OO\n    interface, to this functionality (Openview::Message::Sender, that\n    does not require any changes to the user's namespace. It was\n    uploaded earlier this evening. I am of course open to other\n    suggestions, but I could not think of anyting better, and that\n    seemed to be the concensus of those who did engage in the\n    discussion.\n\n    Lincoln"
   },
   "meta" : {
      "message_id" : "200204260345.FAA08599@pause.perl.org",
      "epoch" : 1019792740,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission Openview::Message",
      "file" : "11421.txt",
      "type" : "module_submission"
   }
}
