{
   "data" : {
      "userid" : {
         "name" : "David J. Goehrig",
         "id" : "DGOEHRIG"
      },
      "description" : "Simple DirectMedia Layer Perl Interface",
      "communities" : "sdlperl@sdlperl.org, http://www.sdlperl.org",
      "chapterid" : {
         "name" : "User_Interfaces",
         "id" : "8"
      },
      "similar" : "SDL is the root of the SDL_perl-1.18.1, SDL-sdlpl-1.08 packages",
      "DSLIP" : "Rmchl",
      "modid" : "SDL",
      "enteredon" : "Wed May 29 16:09:15 2002 GMT",
      "enteredby" : {
         "name" : "David J. Goehrig",
         "id" : "DGOEHRIG"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "SDL, the Simple DirectMedia Layer, is a cross platform library for\n    developing multimedia applications and games. SDL is the obvious\n    root for the namespace, as it is the traditional abbrev. for the\n    interfaced library.\n\n    This module is the defacto SDL perl interface, as in the two years\n    of existence not single effective alternative has arisen. Both I and\n    Wayne Keenan have alternated maintainership roles, and there is a\n    healthy development community contributing to it. It has also been\n    used by games such as Guillaume Cotenceau's Frozen Bubble\n    http://www.frozen-bubble.org and already has reached a large\n    audience already.\n\n    I am requesting to have SDL added to the module list on behalf of\n    the dozen or so people who have mailed me recently asking why it\n    isn't in CPAN. SDL is a natural candidate for a low level namespace\n    as it encompases a number of additional modules which manage related\n    libraries for handling images, sound effects, audio playback, mpeg\n    movie playback, OpenGL, True Type Fonts, networking, graphics\n    manipulation, and others.\n\n    I'd be happy to answer any other questions,\n\n    David J. Goehrig <dave@sdlperl.org>"
   },
   "meta" : {
      "message_id" : "200205291609.SAA20662@pause.perl.org",
      "epoch" : 1022688556,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission SDL",
      "file" : "11890.txt",
      "type" : "module_submission"
   }
}
