{
   "data" : {
      "userid" : {
         "name" : "Mark McConnell",
         "id" : "MISCHKE"
      },
      "description" : "MPEG Audio Decoder (MAD) library interface",
      "communities" : "nowhere just yet, plans to announce on mad-user/devel mailing\n    list(s)",
      "chapterid" : {
         "name" : "Miscellaneous_Modules",
         "id" : "23"
      },
      "similar" : "Audio::MPEG",
      "DSLIP" : "adhOg",
      "modid" : "Audio::Mad",
      "enteredon" : "Tue Jun 11 18:55:50 2002 GMT",
      "enteredby" : {
         "name" : "Mark McConnell",
         "id" : "MISCHKE"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "This module is an abstraction of the C level interface of the MAD\n    (MPEG Audio Decoder) library. The library, and this perl interface\n    to it, have the primary function of converting one form of audio\n    data (mp3) into another (pcm). I feel this qualifies it for the\n    'Audio' namespace quite well.\n\n    Already, there is a module on CPAN which implements it's own type\n    of interface to the MAD library, and calls itself 'Audio::MPEG.'\n    It's written by Peter Timofejew, and it's one of the modules that\n    got me started on hacking this up in the first place. I choose to go\n    with 'Audio::Mad' because I felt it was the best compromise\n    available; and I didn't think it would be horribly misleading or\n    conflicting to anyone. It represents it's place in the heirarchy,\n    and has a name which is the same as the library it's built on.\n\n    I would obviously still be using 'Audio::MPEG' if I thought that it\n    was good enough. While I respect the work that has gone into that\n    module, I don't feel that it allows you enough access to the MAD\n    decoder library on the whole. It clumps a few things that are\n    distinct in the C API together in the Perl API, and is quite a bit\n    less isomorphic to me in general.\n\n    My goal was to create a Perl interface that looked and worked\n    almost exactly like the C interface, and providing you with\n    opportunity to get at some of the more interesting data. As for the\n    other interfaces for playing mp3's on CPAN -- I don't believe they\n    even compare to what Audio::Mad is trying to offer.\n\n    Audio::Mad is more or less feature complete at this point. It\n    includes all of the relevant calls into the C API, provides\n    accessors for data locked in the MAD structures, and allows one to\n    use naitive perl datatypes with the library very easily. This allows\n    you to take in mp3 data in a perl scalar, send it through the\n    appropriate chain of objects, and you end up with pcm data in a perl\n    scalar; with various opportunities for mucking around in between.\n\n    I think this module is of enough use to enough people to warrant\n    it's listing on the module list. Plus, I intend to maintain this\n    module, and I look forward to seeing the feedback I get throughout\n    the entire process.\n\n    Thank you for your consideration, mischke"
   },
   "meta" : {
      "message_id" : "200206111855.g5BItrH11914@pause.perl.org",
      "epoch" : 1023821754,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission Audio::Mad",
      "file" : "12125.txt",
      "type" : "module_submission"
   }
}
