{
   "data" : {
      "userid" : {
         "name" : "David Hageman",
         "id" : "DHAGEMAN"
      },
      "description" : "TEILite Document Library",
      "communities" : "",
      "chapterid" : {
         "name" : "String_Lang_Text_Proc",
         "id" : "11"
      },
      "similar" : "",
      "DSLIP" : "adphp",
      "modid" : "TEILite",
      "enteredon" : "Fri Jun 21 08:44:45 2002 GMT",
      "enteredby" : {
         "name" : "David Hageman",
         "id" : "DHAGEMAN"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "This library package is not the most easiest to classify. The Text\n    Encoding Initiative is a group that has defined a schema originally\n    SGML based for the generic mark-up of documents. It is slowly\n    starting to be adopted by libraries and electronic document centers\n    (even more so now that an XML version of the specification has been\n    produced). The TEI specification is quite large as it is designed to\n    be able to markup from everything to songs to poetry to technical\n    papers to novels. Since the full TEI specification is quite large a\n    'Lite' version was made that is a subset that allows a person to\n    markup over 90% of the type of documents one would encounter. The\n    goal of this library is to implement the TEILite specification that\n    is based on XML as this seems to be the most common path that\n    libraries and such are using. It might be better to make a generic\n    TEI root node and put this under TEI::TEILite or possibly\n    XML::Schema::TEILite. I think I would like to stay away from the\n    XML::Schema::TEILite as the XML::Schema might provide the wrong\n    impression (as in modules for building XML schema models)."
   },
   "meta" : {
      "message_id" : "200206210844.g5L8ijc06393@pause.perl.org",
      "epoch" : 1024649085,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission TEILite",
      "file" : "12297.txt",
      "type" : "module_submission"
   }
}
