{
   "data" : {
      "userid" : {
         "name" : "Christian Glahn",
         "id" : "PHISH"
      },
      "description" : "Simple Api for Web Applications",
      "communities" : "",
      "chapterid" : {
         "name" : "World_Wide_Web_HTML_HTTP_CGI",
         "id" : "15"
      },
      "similar" : "CGI::Application, CGI::XMLApplication, Poe",
      "DSLIP" : "bdphp",
      "modid" : "SAWA",
      "enteredon" : "Sun Jul  7 02:47:59 2002 GMT",
      "enteredby" : {
         "name" : "Christian Glahn",
         "id" : "PHISH"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "SAWA stands for Simple API for Web Applications which is borrowed\n    by the idea of SAX known in the XML world. It will provide an\n    abstract interface that allows to implement web applications of\n    different stages of complexity.\n\n    The idea behind SAWA as a Web application interface/ framework is\n    to allow the development of plugable object oriented web\n    applications. Instead of offering a certain application or output\n    style, SAWA tries to offer a lightwight interface that allows\n    generally the change of parts of the application without breaking\n    the global application.\n\n    While very general idea of SAWA is taken from Poe, the major\n    difference to Poe is that SAWA application do not need a separate\n    server to be implemented. The design of the framework is made in a\n    way that it is possible to port both CGI::*Application frameworks\n    without adding to much overhead. This is possible because SAWA\n    provides generally spoken a lightwight outling of what these\n    frameworks concider to be a CGI application. by just outlining the\n    application structure SAWA offers more flexibility than both of\n    them.\n\n    Until now it becomes not clear why I would like to request a\n    toplevel namespace. While many web applications start as ordinary\n    CGI scripts most of them grow over the time and are ported to\n    mod_perl, which is part of the Apache namespace (yes, you should\n    know) ;) Still SAWA separates the data delivering from the core\n    application logic, which allows to easily switch between mod_perl\n    and plain CGI environments. As well in the current state of\n    development the application logic can be plugged to the AxKit\n    server, without changing almost no code. Another reason why SAWA\n    might be a toplevel namespace is the point, that it shouldn't be too\n    much effort implement separate IO interfaces that can be plugged to\n    the core application logic object, so the application can run within\n    a Jabber environment.\n\n    Therefore SAWA supports application development using existing\n    servers. Thus it cannot be simply bound to the CGI or the Apache\n    namespace, as I think.\n\n    This may support development towards the idea of open source:\n    Rather then implementing an entire web application themself a\n    programmer can concentrate more to the application logic and reuse\n    sollutions of various content delivering techiques depending of the\n    needs of the given application. As well one can choose between\n    different and relativly strict frameworks that support the\n    development of the application logic. In this context the output\n    schemes are strictly separated from the application logic. So it is\n    possible to reuse different content delivering techniques\n    independent from the application class used in a given case.\n\n    Each of the parts are ment to be object oriented, while these\n    objects communicate with eachother thrugh a well defined--but simple\n    interface. This includes the possibility of cascading various\n    \"subapplications\".\n\n    I hope it becomes clear about the intention and the target of the\n    set of modules that should be covered by this namespace.\n\n    Christian Glahn"
   },
   "meta" : {
      "message_id" : "200207070247.g672lxN30713@pause.perl.org",
      "epoch" : 1026010079,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission SAWA",
      "file" : "12529.txt",
      "type" : "module_submission"
   }
}
