{
   "data" : {
      "userid" : {
         "name" : "Christian Barkey",
         "id" : "CBARKEY"
      },
      "description" : "Reuters SourceSinkLibrary Triarch",
      "communities" : "",
      "chapterid" : {
         "name" : "Commercial_Software_Interfaces",
         "id" : "24"
      },
      "similar" : "",
      "DSLIP" : "adhfg",
      "modid" : "Reuters::SSL",
      "enteredon" : "Fri Jul 19 14:44:05 2002 GMT",
      "enteredby" : {
         "name" : "Christian Barkey",
         "id" : "CBARKEY"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "The toplevel Namespace Reuters should declare unmistakeably the\n    affiliation to be a Product to deal with Reuters Software.\n\n    SSL, the Source Sink Library, ist the well known name in Reuters\n    terms to describe the Suite to gather and contribute data from and\n    to the Reuters Triarch. Indeed, it could be misunderstand to be the\n    Secure Socket Layer Procotol used for HTTPS - connections but the\n    top-level makes it very clear that the product affiliates as a\n    Reuters Product. This was already discussed in\n    module-authoers@perl.org and the only other good suggestions was\n    Reuters::Realtime. But this could also lead to misunderstandings in\n    terms of a realtime network as well as Reuters has another realtime\n    - Product called TIBCO.\n\n    There is actually no contributed module to access Reuters Data from\n    a Triarch. I've seen that in 98 somebody tried to, but I wasn't able\n    to contact him by email.\n\n    Therefore I know there is some need for this nice and handy\n    Perl-Module out there.\n\n    Why a new rootlevel? Well, this is only the beginning... Reuters\n    has many products, one is the Triarch Realtime, a second is the\n    TIBCO (new infrastructur for realtime data) and there are several\n    services for historical and other purpose data which are accessed\n    each in a unique way and should all go under this top level."
   },
   "meta" : {
      "message_id" : "200207191444.g6JEi6g06239@pause.perl.org",
      "epoch" : 1027089846,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission Reuters::SSL",
      "file" : "12741.txt",
      "type" : "module_submission"
   }
}
