{
   "data" : {
      "userid" : {
         "name" : "Midh Mulpuri",
         "id" : "MIDH"
      },
      "description" : "Extract metadata from various file formats",
      "communities" : "module-authors@perl.org",
      "chapterid" : {
         "name" : "Miscellaneous_Modules",
         "id" : "23"
      },
      "similar" : "",
      "DSLIP" : "bdpOo",
      "modid" : "FileMetadata",
      "enteredon" : "Sun Jul 28 23:52:51 2002 GMT",
      "enteredby" : {
         "name" : "Midh Mulpuri",
         "id" : "MIDH"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Metadata is data on data. Such data can include the author of a\n    document or the keywords describing the content in a document among\n    others. FileMetadata is a framework for extracting metadata from\n    various formats and storing such data.\n\n    There are two types of components in the framework.\n\n    Miners : Miners extract specific Metadata from a file. They\n    specialize in specific data or specific file formats. Miners\n    implement the FileMetadata::Miner interface and are packaged in the\n    FileMetadata::Miner::* namespace.\n\n    Stores : A store is used in an application to store Metadata from\n    multiple miners. Stores implement the FileMetadata::Store interface\n    and are packaged under the FileMetadata::Store::* namespace.\n\n    A predefined interface makes it possible for miners to be written\n    for specific file formats or customized for specific applications.\n    Several miners can be used to extract all required metadata from a\n    file. The stores provide an optional and uniform interface to store\n    such metadata.\n\n    Consider an application which needs to extract metadata from\n    several file formats - such as Open Office files and HTML files. A\n    miner for each format supports the same interface making the task of\n    writing an application much easier.\n\n    In the absence of related modules, 'FileMetadata' cannot be grouped\n    under any other namespace. It could probably be grouped under 'File'\n    but it does not provide any functions to work with files directly.\n    Instead it extracts and stores metadata from the files. The\n    suggestion for the 'FileMetadata' came from Tim Bunce on the\n    module-authors mailing list. This namespace is both suggestive of\n    the module's purpose and avoid grouping this module with unrelated\n    modules."
   },
   "meta" : {
      "message_id" : "200207282352.g6SNqrc02746@pause.perl.org",
      "epoch" : 1027900373,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission FileMetadata",
      "file" : "12901.txt",
      "type" : "module_submission"
   }
}
