{
   "data" : {
      "userid" : {
         "name" : "Stas Bekman",
         "id" : "STAS"
      },
      "description" : "Automatic Backtrace Extractor on SIG Faults",
      "communities" : "modules@perl.org",
      "chapterid" : {
         "name" : "Development_Support",
         "id" : "3"
      },
      "similar" : "Devel::CoreStack",
      "DSLIP" : "adhOa",
      "modid" : "Debug::FaultAutoBT",
      "enteredon" : "Wed Aug  7 04:08:27 2002 GMT",
      "enteredby" : {
         "name" : "Stas Bekman",
         "id" : "STAS"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "When a signal, that normally causes a coredump, is delivered This\n    module attempts to automatically extract a backtrace, rather than\n    letting the core file be dumped. This has the following benefits:\n\n    * no need to setup the environment to allow core file dumped.\n    Sometimes people just don't know how to set it up. Sometimes you\n    aren't allowed to set it up (e.g., when the webserver environment is\n    not under your control).\n\n    * if many Perl programs are run in a row and more than one program\n    segfaults it's possible to collect all backtraces, rathen then\n    aborting the run on the first segfault or staying with only the last\n    core file, which will overwrite all the previous ones. For example\n    consider a live webserver or a test suite which may segfault many\n    times for different reasons.\n\n    * for huge core files, this approach saves disk space. And can be a\n    saver when you don't have disk space left for various reasons\n    (passed the quota?), but still have a few kilo-bytes left.\n\n    ---\n\n    Devel::CoreStack tries to do the same but requires a core file,\n    which is sometimes hard or impossible to get. My module attempts to\n    achieve the same without any extra work.\n\n    ---\n\n    I've used the root Debug:: namespace instead of Devel::, since this\n    module is really for the end users not developers. We (developers)\n    want users to send us backtraces when they get segfaults. Users\n    shouldn't be intimidated by the Devel:: root namespace. I hope this\n    is a good reason for opening a new root namespace for this"
   },
   "meta" : {
      "message_id" : "200208070408.g7748SA14233@pause.perl.org",
      "epoch" : 1028693308,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission Debug::FaultAutoBT",
      "file" : "13065.txt",
      "type" : "module_submission"
   }
}
