{
   "data" : {
      "userid" : {
         "name" : "Miko O'Sullivan",
         "id" : "MIKO"
      },
      "description" : "Indent here documents",
      "communities" : "",
      "chapterid" : {
         "name" : "Perl_Core_Modules",
         "id" : "2"
      },
      "similar" : "",
      "DSLIP" : "bdppp",
      "modid" : "Filter::HereDocIndent",
      "enteredon" : "Tue Aug  6 17:00:58 2002 GMT",
      "enteredby" : {
         "name" : "Miko O'Sullivan",
         "id" : "MIKO"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "NAME\n\n    Filter::HereDocIndent - Indent here documents\n\n    SYNOPSIS\n\n    use Filter::HereDocIndent; if ($sometest) { print <<'(MYDOC)';\n    Melody Starflower Miko (MYDOC) }\n\n    outputs (with text beginning at start of line):\n\n    Melody Starflower Miko\n\n    DEPENDENCIES\n\n    HereDocIndent requires Filter::Util::Call, which is part of the\n    standard distribution starting with Perl 5.6.0. For earlier versions\n    of Perl you will need to install Filter::Util::Call, which requires\n    either a C compiler or a pre-compiled binary.\n\n    DESCRIPTION\n\n    HereDocIndent allows you to indent your here documents along with\n    the rest of the code. The contents of the here doc and the ending\n    delimiter itself may be indented with any amount of whitespace. Each\n    line of content will have the leading whitespace stripped off up to\n    the amount of whitespace that the closing delimiter is indented.\n    Only whitespace is stripped off the beginning of the line, never any\n    other characters For example, in the following code the closing\n    delimiter is indented eight spaces: if ($sometest) { print\n    <<'(MYDOC)'; Melody Starflower Miko (MYDOC) }\n\n    All of the lines in that example will have the leading eight\n    whitespace characters removed, thereby outputting the content at the\n    beginning of the line (single space added for email readers): Melody\n    Starflower Miko\n\n    If a line is indented more than the closing delimiter, it will be\n    indented by the extra amount in the results. For example, this code:\n\n    if ($sometest) { print <<'(MYDOC)'; Melody Starflower Miko (MYDOC)\n    }\n\n    produces this output:\n\n    Melody Starflower Miko\n\n    HereDocIndent does not distinguish between different types of\n    whitespace. If you indent the closing delimiter with a single tab,\n    and the contents eight spaces, each line of content will lose just\n    one space character. The best practice is to be consistent in how\n    you indent, using just tabs or just spaces. HereDocIndent will only\n    remove leading whitespace. If one of the lines of content is not\n    indented, the non-whitespace characters will *not* be removed. The\n    trailing newline is never removed."
   },
   "meta" : {
      "message_id" : "200208061701.g76H12409736@pause.perl.org",
      "epoch" : 1028653262,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission Filter::HereDocIndent",
      "file" : "13061.txt",
      "type" : "module_submission"
   }
}
