{
   "data" : {
      "userid" : {
         "name" : "Maciej Ceglowski",
         "id" : "MACIEJ"
      },
      "description" : "Latent semantic indexing toolkit",
      "communities" : "Will introduce at O'Reilly bioinformatics conference 2003. General\n    writeup at http://javelina.cet.middlebury.edu/lsa/out/lsa_intro.htm",
      "chapterid" : {
         "name" : "String_Lang_Text_Proc",
         "id" : "11"
      },
      "similar" : "none",
      "DSLIP" : "adpOg",
      "modid" : "LSI",
      "enteredon" : "Sun Oct 13 21:28:44 2002 GMT",
      "enteredby" : {
         "name" : "Maciej Ceglowski",
         "id" : "MACIEJ"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Latent semantic indexing is a vector-based technique for indexing\n    large document collections. LSI uses a dimensionality reduction\n    technique called 'singular value decomposition' to vastly improve\n    recall in searching such collections. LSI search engines can return\n    relevant results even when a document does not contain an exact\n    keyword match to the query.\n\n    \"Document\" and \"keyword\" here can be defined very loosely -\n    although traditionally LSI has been applied to natural language\n    text, the technique is purely algebraic, and there are potential\n    applications to DNA sequences, image files, and pretty much anything\n    you can shoehorn into a vector model.\n\n    While LSI has been a theoretical curiosity for many years, this is\n    the first open-source implementation ( to my knowledge ), and the\n    first practical toolkit usable by people outside the computational\n    linguistics community. We hope to make the task of building\n    vector-based search engines, visualization tools, and archive\n    management tools much easier for the casual programmer.\n\n    Because the toolkit includes visualization, clustering and other\n    components that go beyond searching data, I felt the Search::\n    namespace was overly specific. I do understand that the CPAN team\n    may feel very strongly about creating a root-level LSI namespace."
   },
   "meta" : {
      "message_id" : "200210132128.g9DLSjb21729@pause.perl.org",
      "epoch" : 1034544525,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission LSI",
      "file" : "14331.txt",
      "type" : "module_submission"
   }
}
