{
   "data" : {
      "userid" : {
         "name" : "James Robson",
         "id" : "GILAD"
      },
      "description" : "Create blog systems",
      "communities" : "comp.lang.perl.modules",
      "chapterid" : {
         "name" : "Miscellaneous_Modules",
         "id" : "23"
      },
      "similar" : "Apache::Blog Net::Blogger",
      "DSLIP" : "bupOp",
      "modid" : "Blog::Simple",
      "enteredon" : "Thu Oct 17 16:31:35 2002 GMT",
      "enteredby" : {
         "name" : "James Robson",
         "id" : "GILAD"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Blog::Simple is a module aimed at creating simple blog\n    applications. Unlike the Apache::Blog and Net::Blogger modules,\n    which interface to existing systems (Apache and the Blogger XML-RPC\n    API respectively), Blog::Simple can be used for development anywhere\n    Perl is installed---a web server running CGI, on an IIS server\n    running ISAPI, or even at the console, using just Perl.\n\n    Blog::Simple uses a simple text file database similar to a docbase\n    to track blog entries (I've dubbed it a 'blogbase'). Each time a\n    blog is entered, the entry is added to the top of the file. An XML\n    file is generated based on simple, essential tags, and stored in a\n    uniquely named folder on the file system (the blogbase entry has a\n    reference to the path.) By using the file system directly to store\n    data, the module becomes highly portable and doesn't require that a\n    special database system be installed (one that might prove 'too much\n    tool for the job').\n\n    Blog::Simple requires the XML::XSL module to perform blog\n    transformations. This gives the developer a high level of output\n    flexibility, as well as a standard way of addressing blog rendering.\n\n    After emailing modules@perl.com and garnering namespace\n    suggestions, Blog::Simple was given and this seemed to fit the logic\n    of the module. I ruled out using something like CGI::Blog::Simple or\n    WWW::Blog::Simple, since the module is not necessarily web oriented\n    (although in most applications it would be). For instance, I could\n    see someone using it to create a GUI-based personal diary system,\n    one not intended to be shared.\n\n    However, I am not entirely bent on having the namespace be\n    'Blog::Simple'. It looks good, seems logical, and was what I came up\n    with after going through the channels outlined on CPAN for namespace\n    creation. Even after looking at the existing Perl namespaces, it\n    still seemed like a good choice.\n\n    So I leave it in your hands. I'm more interested in getting the\n    module out there than pioneering a new namespace scheme.\n\n    Thank you for your time and consideration.\n\n    J. A. Robson"
   },
   "meta" : {
      "message_id" : "200210171631.g9HGVZt01047@pause.perl.org",
      "epoch" : 1034872295,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission Blog::Simple",
      "file" : "14399.txt",
      "type" : "module_submission"
   }
}
