{
   "data" : {
      "userid" : {
         "name" : "Pat Deegan",
         "id" : "PDEEGAN"
      },
      "portable" : "All modules are written in pure Perl, ensuring maximum",
      "description" : "pure perl API to create and parse XML",
      "communities" : "modules@perl.org",
      "chapterid" : {
         "name" : "String_Lang_Text_Proc",
         "id" : "11"
      },
      "independent" : "The package is small and has no external dependencies",
      "similar" : "XML::DOM",
      "DSLIP" : "bdpOg",
      "modid" : "XML::Simple::PurePerl",
      "simple" : "The API is easy to learn and use. While providing a number",
      "enteredon" : "Mon Oct 28 02:47:00 2002 GMT",
      "enteredby" : {
         "name" : "Pat Deegan",
         "id" : "PDEEGAN"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Greetings,\n\n    This is a resubmission (with a new name, based on previous\n    discussion with Brian D. Foy in the thread starting with message\n    http://archive.develooper.com/modules@perl.org/msg13839.html) of a\n    pure perl, object-oriented API that provides classes for XML\n    documents, elements and nodes and allows you to generate, parse and\n    manipulate XML documents.\n\n    XML::Simple::PurePerl is a \"stand-alone\" module in that it does not\n    require additional libraries or even a compiler to install and is,\n    in my opinion, flexible and easy to use. A project site was created\n    (http://minixml.psychogenic.com) where you can find detailed\n    information on the interface. Developer response has so far been\n    positive.\n\n    The module is\n\n    simple: The API is easy to learn and use. While providing a number\n    of classes in the package and offering XML generation and parsing\n    functionality, users only need to interact with 2 of those classes.\n\n    independent: The package is small and has no external dependencies\n    or requirements. You can therefore easily install it on any host,\n    for instance in the case of a web server to which you only have FTP\n    access - just upload it and begin using the module in your CGIs.\n\n    portable: All modules are written in pure Perl, ensuring maximum\n    portability.\n\n    I've run a quick script using the latest version of the module,\n    which simply reads in a (large) XML file (which you can find at\n    http://www.w3.org/TR/1998/REC-xml-19980210.xml - it is the XML\n    specification ) and parses it. I then request the document be\n    stringified. This is a good test of the parsing abilities as the XML\n    is completely decomposed then recreated. You can find the resulting\n    output attached to message\n    http://archive.develooper.com/modules@perl.org/msg13887.html\n\n    Regards,\n\n    Pat Deegan http://www.psychogenic.com"
   },
   "meta" : {
      "message_id" : "200210280247.g9S2l2h32169@pause.perl.org",
      "epoch" : 1035773222,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission XML::Simple::PurePerl",
      "file" : "14752.txt",
      "type" : "module_submission"
   }
}
