{
   "data" : {
      "userid" : {
         "name" : "Tom Scanlan",
         "id" : "TSCANLAN"
      },
      "categories" : "Network Container, Network Devices, and Detection",
      "description" : "discovery of network hosts and topology",
      "communities" : "comp.lang.perl.modules",
      "chapterid" : {
         "name" : "Networking_Devices_IPC",
         "id" : "5"
      },
      "similar" : "",
      "DSLIP" : "adpOp",
      "modid" : "Net::Discovery",
      "enteredon" : "Fri Dec 27 20:20:18 2002 GMT",
      "enteredby" : {
         "name" : "Tom Scanlan",
         "id" : "TSCANLAN"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Net::Discovery is a tool set for the discovery of network topology\n    and the devices on the network. I haven't seen anything like this in\n    CPAN, and have had a hard time finding any help in area of network\n    discovery (on a budget).\n\n    Net::Discovery consists of several modules that all fit into three\n    categories: Network Container, Network Devices, and Detection\n    Modules. The detection modules detect devices in an extensible\n    fashion. Currently detection modules exist to find hosts via\n    ehternet sniffing, traceroutes, or by manual entry, but any number\n    of other detection modules can be created. These devices have an\n    extensible set of attributes that are stored in a device object. In\n    turn, the devices are stored in the network container. Queries about\n    the devices or the connetivity between devices can then be run\n    against the network object. Changes in the state of the network can\n    also be monitored via these queries.\n\n    I believe that Net:: is the right place for this set of modules,\n    and the Discovery is a fitting description of what they do. If this\n    isn't the right place or if you need more info so that we can find\n    the right place, let me know.\n\n    Tom Scanlan (cpan: TSCANLAN)"
   },
   "meta" : {
      "message_id" : "200212272020.gBRKKMq31590@pause.perl.org",
      "epoch" : 1041020422,
      "from" : "upload@p11.speed-link.de",
      "subject" : "Module submission Net::Discovery",
      "file" : "16464.txt",
      "type" : "module_submission"
   }
}
