{
   "data" : {
      "userid" : {
         "name" : "Eric J. Roode",
         "id" : "ROODE"
      },
      "description" : "Create read-only scalars, arrays, hashes.",
      "communities" : "comp.lang.perl.modules, RPI lily",
      "chapterid" : {
         "name" : "Data_Type_Utilities",
         "id" : "6"
      },
      "similar" : "constant",
      "DSLIP" : "Rdprp",
      "modid" : "Readonly",
      "enteredon" : "Tue Jan  7 22:12:06 2003 GMT",
      "enteredby" : {
         "name" : "Eric J. Roode",
         "id" : "ROODE"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "This module provides a useful extension to fundamental Perl data\n    types, allowing them to be marked as non-modifiable at runtime or\n    compile-time. It provides several advantages in both interface and\n    functionality over the \"constant\" pragma.\n\n    \"constant\" creates pseudo-variables that look like C macros (for\n    example, no leading $@% character). It's sometimes difficult to use\n    these \"variables\" -- you can't take references to them, you have to\n    be careful when using them in certain syntactically-ambiguous\n    situations (eg as hash keys). It's difficult to create and use\n    hierarchical variables (a constant array of arrays of hashes, eg).\n    You can't really make constant hashes with it (indeed, you can't\n    really make constant arrays, only constant lists).\n\n    Readonly solves all of these problems. The variables it creates\n    retain their leading $@% character; you can take references to them\n    and the referent remains read-only; it's simple to make hierarchical\n    data structures read-only -- either at the top-level only, or\n    deeply.\n\n    Since this module's function is of a fundamental nature, and since\n    it includes a small hierarchy of subordinate packages, I believe\n    that a top-level namespace is justified. It is my hope that the Perl\n    community will agree.\n\n    Thanks."
   },
   "meta" : {
      "message_id" : "200301072212.h07MC7s11851@pause.perl.org",
      "epoch" : 1041977527,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission Readonly",
      "file" : "16760.txt",
      "type" : "module_submission"
   }
}
