{
   "data" : {
      "userid" : {
         "name" : "Rocco Caputo",
         "id" : "RCAPUTO"
      },
      "description" : "fullscreen split-terminal user interface",
      "communities" : "efnet, magnet, dalnet: #perl, #poe; http://sf.net/projects/visterm",
      "chapterid" : {
         "name" : "User_Interfaces",
         "id" : "8"
      },
      "similar" : "none found in the UI and Term:: sections of search.cpan.org",
      "DSLIP" : "adpOp",
      "modid" : "Curses::Visterm",
      "enteredon" : "Thu Jan  9 19:38:10 2003 GMT",
      "enteredby" : {
         "name" : "Rocco Caputo",
         "id" : "RCAPUTO"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Curses::Visterm is a \"visual\" (split-screen) terminal interface.\n    The term \"visual\" has been used to describe display-oriented\n    interfaces at least as far back as the invention of vi. TinyFugue\n    has described its split-terminal mode as \"visual\" for several years.\n    For more information:\n\n    http://www.egr.msu.edu/decs/facilities/software/vi.php#Whatis\n    http://www.muq.org/~hawkeye/tf/help/topics/mode.html\n\n    Curses::Visterm provides a split-terminal interface modeled after\n    console based IRC and MUD clients. It uses Curses to manage all\n    aspects of the terminal, including horizonatal and vertical\n    scrolling regions.\n\n    The interface has four sections. There is a title bar across the\n    top of the terminal, a large vertically scrolling (forward and\n    backward) region where program output is displayed, an input bar\n    across the bottom of the display (which scrolls horizontally to\n    accomodate large input and can be edited using common shell\n    keybindings), and a status bar that separates the output and input\n    areas with a display of common \"dashboard\" indicators.\n\n    Visterm uses a portable, event driven framework (POE) for\n    concurrency. It can simultaneously monitor socket and console input\n    while updating dashboard indicators through a system of multiple\n    independent timers.\n\n    The project is managed at SourceForge. Various support resources\n    are available there. Please see\n    http://sourceforge.net/projects/visterm/ for more information."
   },
   "meta" : {
      "message_id" : "200301091938.h09JcBH10860@pause.perl.org",
      "epoch" : 1042141091,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission Curses::Visterm",
      "file" : "16845.txt",
      "type" : "module_submission"
   }
}
