{
   "data" : {
      "userid" : {
         "name" : "Gene Gallistel",
         "id" : "GRAVALO"
      },
      "description" : "for creating file sharing clients/servers",
      "communities" : "posted to perlmonks.org forum, planning to post to public CVS repos\n    & newsgroups",
      "chapterid" : {
         "name" : "Networking_Devices_IPC",
         "id" : "5"
      },
      "similar" : "",
      "DSLIP" : "adpOg",
      "modid" : "Net::FileShare",
      "enteredon" : "Sat Jan 18 20:19:33 2003 GMT",
      "enteredby" : {
         "name" : "Gene Gallistel",
         "id" : "GRAVALO"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "I began the development for this mod while working on an ICB bot. I\n    wanted to have a simple compartmentalized solution which could be\n    added to a bot or chat client to give them a file sharing\n    capability. While beginning work on this project I searched the web\n    for a module similiar to this. I could only find scripts in which\n    individuals had set up file sharing clients and server. This module\n    allows for a OO interface, so in 8-10 lines one could set up a\n    server or client. This is the main rationale behind the request for\n    the namespace. I don't believe there are any modules which focus\n    soley on file sharing. Besides allowing for an OO interface to\n    client/server construction, I've also written in a basic protocol,\n    into the module, for message passing between the server and clients.\n    The protocol is used to allow clients to query for files contained\n    on servers, and to allow servers to either acknowledge or reject\n    query requests. This mod currently is in alpha testing. While\n    testing, I've successfully managed to transfer both ascii and binary\n    files up to 4MB, between hosts running Net::FileShare clients and\n    servers."
   },
   "meta" : {
      "message_id" : "200301182019.h0IKJYh17036@pause.perl.org",
      "epoch" : 1042921174,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission Net::FileShare",
      "file" : "17186.txt",
      "type" : "module_submission"
   }
}
