{
   "data" : {
      "userid" : {
         "name" : "Philip Crow",
         "id" : "PHILCROW"
      },
      "description" : "draws sequence diagrams by running the code",
      "communities" : "?",
      "chapterid" : {
         "name" : "Images_Pixmaps_Bitmaps",
         "id" : "18"
      },
      "similar" : "?",
      "DSLIP" : "adpOp",
      "modid" : "UML::Sequence",
      "enteredon" : "Mon Jan 27 21:37:24 2003 GMT",
      "enteredby" : {
         "name" : "Philip Crow",
         "id" : "PHILCROW"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "There are probably several people who would like to build tools for\n    the production and manipulation of UML. I know I am one. There is\n    not a UML top level now. I think there should be. When my boss wants\n    UML, I don't want to have to use Visio to produce it. I don't even\n    want to produce it manually from the command line. Perl should do\n    this sort of thing for me.\n\n    There is another CPAN user TEEJAY who has a package he calls\n    AutoDia which draws other UML diagrams (class diagrams, etc.). So\n    far as I could tell from the docs, AutoDia does not draw sequence\n    diagrams. Further, it is not on CPAN.\n\n    The module I'm ready to submit (UML::Sequence) runs a perl program\n    of your choice under Devel::DProf and (together with other provided\n    scripts and UML::Sequence::* modules) generates an svg picture of\n    the sequence of calls which actually executed. You have control over\n    which functions appear in the output.\n\n    You can also produce a sequence diagram just by typing in an\n    outline of the calls.\n\n    If you're willing to write your own three function module, you can\n    generate your own sequences for other languages or input formats.\n    I've demonstrated this by writing the proper module for Java and\n    supplying a Java program to feed it (I wish the Java debugger\n    architecture had Perl hooks). This could be included in the\n    distribution if the CPAN maintainers wouldn't be too offended by the\n    presence of Java code on CPAN."
   },
   "meta" : {
      "message_id" : "200301272137.h0RLbOn04576@pause.perl.org",
      "epoch" : 1043703444,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission UML::Sequence",
      "file" : "17430.txt",
      "type" : "module_submission"
   }
}
