{
   "data" : {
      "userid" : {
         "name" : "Gaciliano Monteiro Passos",
         "id" : "GMPASSOS"
      },
      "description" : "Hybrid DataBase",
      "communities" : "hdb.sf.net",
      "chapterid" : {
         "name" : "Database_Interfaces",
         "id" : "7"
      },
      "similar" : "doesn't exist",
      "DSLIP" : "RmpOg",
      "modid" : "HDB",
      "enteredon" : "Wed Jan 29 14:11:43 2003 GMT",
      "enteredby" : {
         "name" : "Gaciliano Monteiro Passos",
         "id" : "GMPASSOS"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "I know that this is for a root module, but this need to be\n    independent of other module, and have a concept different.\n\n    HDB is an alternative to DBI. The idea is to have a interface to\n    databases that is independent of the database type. You can use\n    Mysql, Oracle, SQLite, and any other type of database, but you don't\n    need to know what DB you are using. You just work with HDB, and all\n    the convertions of SQL syntax and use of resources that one DB has\n    and other not is made automatically. Other thing about the module is\n    that you only need to know Perl to use it, you don't need to learn\n    SQL (or how each DB work with SQL), and everything is based on Perl\n    syntax and commands, inclusing the querys to the DB.\n\n    For example, I develope a site with HDB, and I test it in my Win2k\n    desktop, using HDB::SQLite, but when I send to the server (Linux) it\n    works with HDB::Mysql, the only thing that I change is in the\n    HDB->new(type=>'sqlite'...) to HDB->new(type=>'mysql'...). HDB make\n    all the convertions of types of columns, and resources.\n\n    The module is in test stage (during 30 days). I want to test it a\n    lot before publish, and I think that now the 1.0 version is stable."
   },
   "meta" : {
      "message_id" : "200301291411.h0TEBj427726@pause.perl.org",
      "epoch" : 1043849505,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission HDB",
      "file" : "17474.txt",
      "type" : "module_submission"
   }
}
