{
   "data" : {
      "userid" : {
         "name" : "James Tavares",
         "id" : "JTAVARES"
      },
      "description" : "Object to Configure Linksys SOHO Units",
      "communities" : "linksys-config@krontor.net",
      "chapterid" : {
         "name" : "Miscellaneous_Modules",
         "id" : "23"
      },
      "similar" : "",
      "DSLIP" : "bdpOp",
      "modid" : "Linksys::Config",
      "enteredon" : "Fri Feb 14 20:46:06 2003 GMT",
      "enteredby" : {
         "name" : "James Tavares",
         "id" : "JTAVARES"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "About 'Modules with similar functionality': I am not aware of any\n    modules that configure Linksys devices in this manner.\n\n    Module Description/Purpose: To configure Linksys \"Instant Broadband\n    Series\" routers (BEFSR41 and the like). Currently, there is no other\n    way to configure these units other than to manually navigate through\n    HTML forms using a web browser such as Netscape. The routers lacks\n    SNMP support as well as any method of exporting/importing\n    configurations, which is useful when working with large quantities\n    of routers. What was needed was a Perl interface to quickly perform\n    firmware upgrades (via TFTP), import/export configurations, change\n    passwords, and modify various settings.\n\n    I believe the module will be helpful to those seeking a means to\n    configure their Linksys SOHO Router units without being tied to a\n    web browser. The module bridges the gap between Linksys's current\n    HTML only solution and SNMP-like support, which these routers do not\n    have.\n\n    Bundled with the module is also \"Linksys::Config:TFTP\", a modified\n    version of \"Net::TFTP\" that supports Linksys's proprietary extension\n    to the TFTP protocol to support password authentication.\n\n    I believe the namespace \"Linksys::Config\" accurately reflects the\n    purpose and style of this module. The module's only purpose is to\n    configure Linksys routers, using a series of POSTs over the HTTP\n    protocol to specific CGIs on the Linksys router, and in specific\n    order. The module also is written to interpret the specific HTML\n    output of the Linksys router series."
   },
   "meta" : {
      "message_id" : "200302142046.h1EKk7V14116@pause.perl.org",
      "epoch" : 1045255567,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission Linksys::Config",
      "file" : "17848.txt",
      "type" : "module_submission"
   }
}
