{
   "data" : {
      "userid" : {
         "name" : "Aran Deltac",
         "id" : "BLUEFEET"
      },
      "description" : "Calculate Distances and Closest Locations",
      "communities" : "comp.lang.perl.modules",
      "chapterid" : {
         "name" : "Miscellaneous_Modules",
         "id" : "23"
      },
      "similar" : "Geo::PostalCode Math::Trig",
      "DSLIP" : "adphp",
      "modid" : "Geo::Distance",
      "enteredon" : "Tue Feb 18 21:52:38 2003 GMT",
      "enteredby" : {
         "name" : "Aran Deltac",
         "id" : "BLUEFEET"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "While researching calculating distances I realized that it would be\n    useful if I made a higher level API for doing distance calculations\n    - especially for finding closest locations. Then I thought the Perl\n    community would like it. So far nobodies said 'nay' to the concept,\n    but neither has anyone shown great interest. Nothing out there\n    Perl-wise does what I've written as far as I can find.\n\n    This module can for the most part do everything Geo::PostalCode\n    does. Althought, it still has its place, I intend to add even more\n    functionality to actually supersiede and, as I've already done step\n    much further in the direction of a general purpose module that can\n    do many different things in many different ways when it comes you\n    geographic distances.\n\n    The complicated distance calculations are done by Math::Trig.\n    Which, in itself, if all you have is Math::Trig, you have everything\n    you need to calculate geographic distances. My module takes it quite\n    a few steps farther by having pre-defined unit types, ability to\n    define your own units, calculate distances for a large number of\n    locations and returning the closest (via several method including a\n    database connection), and of course other cool things.\n\n    Anyways, I hope you let me use this namespace. I'd consider it an\n    honor."
   },
   "meta" : {
      "message_id" : "200302182152.h1ILqcf11678@pause.perl.org",
      "epoch" : 1045605158,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission Geo::Distance",
      "file" : "17927.txt",
      "type" : "module_submission"
   }
}
