{
   "data" : {
      "homepage" : "",
      "userid" : "GROSSMANN",
      "fullname" : "Björn Grossmann",
      "why" : "As part of my master thesis in mathematics, I am develloping a\n    bundle of modules that allow conversion of System Dynamics models\n    created in Stella to any target language. I am currently supporting\n    C, Java, Matlab and Perl. This allows you to run your model (much)\n    faster and to plugin libraries, such as optimization algorithms in\n    order to find values for policy parameters for which an objective\n    functions from within the model reaches a global optimum. I have\n    seperated the part the parses the (Stella) model and the part that\n    does the output (in Perl, C, Java, etc.), so that it should be easy\n    to add code that allows parsing of models written in other\n    environments such as Powersim or Vensim. Adding additional output\n    languages is very straight forward, all you need to do, is to\n    subclass a class responsible for output and overwrite some methods\n    specifying how the code should look like in your language of choice.\n\n    For those of you, who are wondering what System Dynamics is, you\n    might want to have a look at http://www.systemdynamics.org/\n\n    An excerpt: \"System dynamics is a methodology for studying and\n    managing complex feedback systems, such as one finds in business and\n    other social systems. In fact it has been used to address\n    practically every sort of feedback system. While the word system has\n    been applied to all sorts of situations, feedback is the\n    differentiating descriptor here. Feedback refers to the situation of\n    X affecting Y and Y in turn affecting X perhaps through a chain of\n    causes and effects. One cannot study the link between X and Y and,\n    independently, the link between Y and X and predict how the system\n    will behave. Only the study of the whole system as a feedback system\n    will lead to correct results.\"",
      "mail" : "CENSORED"
   },
   "meta" : {
      "message_id" : "200302261108.h1QB8gk27428@pause.perl.org",
      "epoch" : 1046257722,
      "from" : "upload@pause.x.perl.org",
      "subject" : "PAUSE ID request (GROSSMANN;=?UTF-8?Q?=20Bj=C3=B6rn=20Grossmann?=)",
      "file" : "18144.txt",
      "type" : "pause_id_request"
   }
}
