{
   "data" : {
      "userid" : {
         "name" : "Nuno Filipe Monteiro Nunes",
         "id" : "NFMNUNES"
      },
      "description" : "GPS-aquired geographic data management",
      "communities" : "",
      "chapterid" : {
         "name" : "Miscellaneous_Modules",
         "id" : "23"
      },
      "similar" : "",
      "DSLIP" : "cdpOp",
      "modid" : "Geo::GPS::Data",
      "enteredon" : "Thu Mar 20 19:52:16 2003 GMT",
      "enteredby" : {
         "name" : "Nuno Filipe Monteiro Nunes",
         "id" : "NFMNUNES"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "First off a description of the package and its goal: This package\n    (being prepared for upload to CPAN in a couple of weeks or so) will\n    be useful for managing the geographic data collected with and being\n    fed to a GPS unit. It does not provide any interface to a physical\n    GPS unit, it assumes you can get the data and feed it to the module\n    and vice-versa. It also is (as far as I could think of it) GPS-brand\n    and -model agnostic. If it is not I *will* change it to be so! :)\n    The package uses an object-oriented approach to the creation and\n    manipulation of waypoint objects and waypoint collections (general\n    collections, track logs and routes). The storage of these items is\n    implemented in separate modules so that it will be possible (and\n    hopefully easy) to write new modules to support different storage\n    mechanisms. Initially I will provide an mysql storage module.\n\n    Concerning the namespace: I am aware of two namespaces concerning\n    GPS-related stuff: GPS: The top-level name used, so far, to support\n    device-specific packages (GPS::Garmin and GPS::Lowrance); Geo::GPS:\n    This namespace was discussed previously but I don't think it is\n    being used right now by any package.\n\n    I am somewhat divided about which namespace to choose (it could be\n    either GPS::Data or Geo::GPS::Data with helper modules bellow any of\n    these) but I tend to go with Geo::GPS::Data because while the\n    package will provide a way to deal with data gathered from and used\n    by a GPS unit but it's object of interest is the geographic data\n    more than the GPS itself."
   },
   "meta" : {
      "message_id" : "200303201952.h2KJqGU15316@pause.perl.org",
      "epoch" : 1048189936,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission Geo::GPS::Data",
      "file" : "19632.txt",
      "type" : "module_submission"
   }
}
