{
   "data" : {
      "homepage" : "",
      "userid" : "RAJKPRI",
      "fullname" : "PADMARAJ K.SHANKAR",
      "why" : "Hi ,\n\n    I am intending to contribute a module that shall aid in migration\n    of data from sybase or informix to Oracle.\n\n    The Migration projects of the sort usually requires creation of\n    control files for the tables in Oracle and my module can create\n    control files for all the tables in Oracle Schema .\n\n    The data from Sybase or Informix databases , when required to be\n    loaded , requires the control files as they cannot be imported\n    otherwise.This is usually a long process to write control files for\n    many tables manually.\n\n    This module can create control files for one or more tables and can\n    set date attributes for any column of the table or for all the date\n    columns of the table.The Default attributes can also be added.\n\n    The miscellaneous advantages are that the column names and\n    datatypes are always correct for their spellings and the column\n    order is also by the column id and hence the control files are apt\n    for the position of the columns.\n\n    use CreateCtl; my $CreateCtl = new CreateCtl;\n    $CreateCtl->set_dbh($dbh); $CreateCtl->set_path($path);\n    $CreateCtl->set_date_format($format,@tables);\n    $CreateCtl->CreateCtlFiles();\n\n    __END__\n\n    Also , I am intending to address methods to port the data for these\n    known data format changes.\n\n    The Method that ports the Date format .\n\n    The date format which is usually \"Mon DD YYYY HH:MI:SS:mls[A|P]M\"\n    in Sybase or informix and in Oracle it can be \"Mon DD YYYY\n    HH24:MI:SS\", so I have written a routine to do this transformation\n    for the data files that come from the sybase or Informix databases.\n\n    The Method that transforms the ^M characters from the data.",
      "mail" : "CENSORED"
   },
   "meta" : {
      "message_id" : "200303251852.h2PIqXG27253@pause.perl.org",
      "epoch" : 1048618353,
      "from" : "upload@pause.x.perl.org",
      "subject" : "PAUSE ID request (RAJKPRI; PADMARAJ K.SHANKAR)",
      "file" : "19828.txt",
      "type" : "pause_id_request"
   }
}
