{
   "data" : {
      "userid" : {
         "name" : "Hasanuddin Tamir",
         "id" : "HASANT"
      },
      "description" : "Merge configurations from various sources",
      "communities" : "",
      "chapterid" : {
         "name" : "Opt_Arg_Param_Proc",
         "id" : "12"
      },
      "similar" : "",
      "DSLIP" : "cdpfp",
      "modid" : "Config::Merge",
      "enteredon" : "Tue Apr  1 06:41:12 2003 GMT",
      "enteredby" : {
         "name" : "Hasanuddin Tamir",
         "id" : "HASANT"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "I've developed several complex applications. Some parts are\n    configurable via configuration file. The parameters can also be\n    defined by a script. In the application core I set the default\n    configuration values. I need to merge this three sources of\n    configuration to get the final configuration set before used in\n    other parts of the application. I've used this mechanism internall.\n    Now, it's just the time to release it to the public in hope that it\n    can be useful to others.\n\n    I've changed the name from something internal to Config::Merge, and\n    I think this is an appopriate name. There's already a namesapce\n    \"Config::\" for configuration parser. So Merge will fit just well. I\n    believe this is the first module in CPAN for this purpose.\n\n    I'm internally testing this module before releasing the first\n    version (0.0.1, alpha stage). In the meantime, this is an excerpt\n    from ABSTRACT:\n\n    Config::Merge merges configuration from at most three sources. Your\n    application may allow users to define configuration in a file, but\n    you also have set predefined (default) configuration. At the end you\n    want single configuration by merging them with a certain precedence.\n    This module will do just that.\n\n    Additionally, Config::Merge provides internal parser for convenient\n    and historical reason, but allows users to provide external parser\n    via CODE reference to suit their need."
   },
   "meta" : {
      "message_id" : "200304010641.h316fDu0003564@pause.perl.org",
      "epoch" : 1049179273,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission Config::Merge",
      "file" : "20066.txt",
      "type" : "module_submission"
   }
}
