{
   "data" : {
      "userid" : {
         "name" : "Olivier Thereaux",
         "id" : "OLIVIERT"
      },
      "description" : "Web log processing and validation",
      "communities" : "http://lists.w3.org/Archives/Public/www-validator/",
      "chapterid" : {
         "name" : "World_Wide_Web_HTML_HTTP_CGI",
         "id" : "15"
      },
      "similar" : "",
      "DSLIP" : "Rmppo",
      "modid" : "W3C::LogValidator",
      "enteredon" : "Tue Apr 15 02:19:58 2003 GMT",
      "enteredby" : {
         "name" : "Olivier Thereaux",
         "id" : "OLIVIERT"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "W3C has a decent number of perl development projects\n    (http://dev.w3.org/cvsweb/perl), and per our coding policy, modules\n    developed at W3C use the W3C:: root namespace.\n\n    These modules used to be experimental tools (mostly proof of\n    concept for the new technologies developed at W3C) but we\n    (especially the new W3C QA development team, in charge of the\n    validator for example) are currently pushing for their release, as\n    well as developing tools for a wider audience (such as this\n    W3C::LogValidator).\n\n    I have pondered whether we should apply for this root namespace\n    (W3C::) or modify our modules and concluded that the namespace would\n    be useful to identify modules related to the development of W3C\n    specifications and technologies (and not just easier for us\n    developers).\n\n    Now for this particular module... It's a rather old project,\n    started as an internal tool at W3C, and everyone would tell us that\n    it would be a good tool for webmaster (at least validation conscious\n    ones) so we developed it as a flexible Log processing/validation\n    module.\n\n    More here: http://www.w3.org/QA/Tools/LogValidator/\n\n    Regards, olivier."
   },
   "meta" : {
      "message_id" : "200304150219.h3F2JwT5000617@pause.perl.org",
      "epoch" : 1050373198,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission W3C::LogValidator",
      "file" : "20410.txt",
      "type" : "module_submission"
   }
}
