{
   "data" : {
      "userid" : {
         "name" : "Lars Lundberg",
         "id" : "LARSLUND"
      },
      "description" : "Reuse and mass produce PDF documents",
      "communities" : "",
      "chapterid" : {
         "name" : "String_Lang_Text_Proc",
         "id" : "11"
      },
      "similar" : "",
      "DSLIP" : "adpfp",
      "modid" : "PDF::Reuse",
      "enteredon" : "Tue Apr 22 13:33:02 2003 GMT",
      "enteredby" : {
         "name" : "Lars Lundberg",
         "id" : "LARSLUND"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "The name of the module is PDF::Reuse. It has good\n    performance,sometimes very good performance, and high capacity. It\n    handles forms, images, text, Acrobat JavaScript and graphics to\n    create new PDF-files. \"Forms\" are ordinary pages from PDF-files\n    transformed to \"XObjects\" (an internal PDF-format), which makes it\n    possible to reuse the page as a unit, create long but compact lists,\n    and to combine it with other elements. Images can be taken from old\n    PDF-files. Text is created with 12 of the 14 standard fonts of\n    Acrobat. You can reuse fonts from imported pages also. You can do\n    \"low level\" programming with the basic graphic operators of PDF.\n    This is powerful possibility. You can mix your \"low level\" code with\n    the forms, fonts and other elements. You can merge JavaScripts from\n    one included PDF-file with scripts you attach to the document you\n    are creating, and you can initiate the attached JavaSripts. These\n    \"interactive\" functions are experimental, but they work with Acrobat\n    5.0 and Acrobat Reader 5.1. The other \"graphic\" functions should be\n    fairly stable. You can have libraries of PDF-code, JavaScripts and\n    \"low level\" modules written in Perl and reuse most of it. As the\n    module has good performance, it is possible to mass produce files\n    with it."
   },
   "meta" : {
      "message_id" : "200304221333.h3MDX3NI018466@pause.perl.org",
      "epoch" : 1051018383,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission PDF::Reuse",
      "file" : "20585.txt",
      "type" : "module_submission"
   }
}
