{
   "data" : {
      "userid" : {
         "name" : "Yves Orton",
         "id" : "YVES"
      },
      "description" : "Easily make MIME/SMTP emails w/attachments.",
      "communities" : "This is really just MIME::Lite but maintained. Its old, and has been\n    discussed pretty much everywhere im sure.",
      "chapterid" : {
         "name" : "World_Wide_Web_HTML_HTTP_CGI",
         "id" : "15"
      },
      "similar" : "MIME::Lite is pretty close to a standard module. It sure is used\n    eveywhere. This is a bug fix, maintenance release/takeover as the\n    author no longer does so.",
      "DSLIP" : "MdpOa",
      "modid" : "MIME::Lite::Maintained",
      "enteredon" : "Thu Apr 24 10:27:51 2003 GMT",
      "enteredby" : {
         "name" : "Yves Orton",
         "id" : "YVES"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "This is an old, mature, and apparently unmaintained module. I have\n    patched it and rereleased it after repreated attempts to contact the\n    author with patches.\n\n    Since I cant register MIME::Lite itself, i've registered\n    MIME::Lite::Maintained. There doesn't seem to be a way to register\n    that modules are unsupported, and to have orphaned modules assigned\n    new foster-parents. So calling the distribution ::Maintained and\n    registering that seemed a logical route. The actual module installed\n    however is MIME::Lite v3.0.\n\n    Main updates are patches to the interaction with MIME::Types, added\n    tests, and a slimmer distribution size.\n\n    I don't intend to actively develop this module, but I do intend to\n    convert the tests to use Test::More and enhance that aspect of\n    things, and I will accept any patches and improvements people might\n    have. And of course there is always the temptation...\n\n    :-)\n\n    If Eryq returns or objects to this \"adoption\" of his module (he has\n    been sent advance notice and opportunity to respond in private) then\n    I am perfectly happy to relinquish control.\n\n    However the fact remains that MIME::Lite is in widespread use, (I\n    think especially on Win32 given its impoverished email facilities),\n    and NEEDS to be maintained. Since I use this module routinely it is\n    in both my benefit and the communities to take over maintenance and\n    ensure it is patched and bug free.\n\n    I think that this is a reasonable course of action given the facts,\n    especially that the code was released under the artisitc licence and\n    the copyrights and attributions have been unaltered in substance.\n\n    Hopefully the powers that be are happy with my takeover of this\n    namespace and we can dispense with the MIME::Lite::Maintained\n    fiction.\n\n    Regards to all, Yves / Demerphq ps: Eryq if you read this please\n    feel free to object! But please maintain the module!"
   },
   "meta" : {
      "message_id" : "200304241027.h3OARp62026131@pause.perl.org",
      "epoch" : 1051180071,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission MIME::Lite::Maintained",
      "file" : "20654.txt",
      "type" : "module_submission"
   }
}
