{
   "data" : {
      "userid" : {
         "name" : "Calle Dybedahl",
         "id" : "CDYBED"
      },
      "description" : "library for talking to Lyskom servers.",
      "communities" : "The \"perlkom\" conference in Lysator's Lyskom server\n    (kom.lysator.liu.se)",
      "chapterid" : {
         "name" : "Miscellaneous_Modules",
         "id" : "23"
      },
      "similar" : "",
      "DSLIP" : "RdpOa",
      "modid" : "Net::Lyskom",
      "enteredon" : "Thu May 22 12:58:55 2003 GMT",
      "enteredby" : {
         "name" : "Calle Dybedahl",
         "id" : "CDYBED"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "The Lyskom conference system lies somewhere in between IRC and\n    USENET. It's been around since 1990, and is a moral descendant of\n    similar systems dating back to QZ-KOM at the Royal Institute of\n    Technology in Stockholm around 1978. It's client/server based, using\n    a wire protocol called \"protocol A\", which is far too generic a term\n    for me to chose it as the name of the module. The main client runs\n    in GNU Emacs, but there are standalone clients available for at\n    least Unix- and MS Windows-based systems. This module is primarily\n    meant to be used when writing robots importing information to a\n    Lyskom server. Existing applications include screenscapers importing\n    news from newspaper websites, and a more general importer for RSS\n    feeds.\n\n    To be honest, I'm not sure that this module should be included in\n    the module list. The target audience is only a few thousand people\n    in Sweden. It's been requested that I upload it to CPAN, to make it\n    easier to find and install for people outside Lysator Academic\n    Computer Society, but that works even without including it in the\n    list, so..."
   },
   "meta" : {
      "message_id" : "200305221258.h4MCwtKR031420@pause.perl.org",
      "epoch" : 1053608335,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission Net::Lyskom",
      "file" : "21272.txt",
      "type" : "module_submission"
   }
}
