{
   "data" : {
      "userid" : {
         "name" : "Stanley Hopcroft",
         "id" : "HOPCROFTS"
      },
      "description" : "Class to simplify Nagios web service checks",
      "communities" : "comp.lan.perl.modules, email with Sean M Burke and Tim Bunce.",
      "chapterid" : {
         "name" : "Miscellaneous_Modules",
         "id" : "23"
      },
      "similar" : "Not in intent, practically however WWW::Automate and WWW::Mechanise\n    probably do.",
      "DSLIP" : "adpOp",
      "modid" : "Nagios::WebTransact",
      "enteredon" : "Sun Jun 15 09:19:08 2003 GMT",
      "enteredby" : {
         "name" : "Stanley Hopcroft",
         "id" : "HOPCROFTS"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Ladies and Gentlemen,\n\n    Quite frankly, this module is weak.\n\n    However, it helps me get my job done in accelerating the generation\n    of Nagios service checks of Web front ends to search engines, data\n    bases and the like (web interfaces that consist of a sequence of\n    fill out forms, where success is recognised by a pattern match at\n    the final response).\n\n    If WWW::Mechanize and ::Automate had been written when this was\n    done, it would probably not exist.\n\n    However, it does have or did some unique features in storing\n    pattern matches and making it possible to incorporate the match\n    result - by callback - in the next forms query string.\n\n    Trash the module if you will, but please register the namespace\n    since others want to use it.\n\n    As for the name space, this module is intended to be one of a\n    series that add value to the Nagios service monitor. Nagios is a\n    popular service monitor that schedules service checks and responds\n    to their results. It features a Perl interpeter built in for\n    accelerating Perl checks and because it is written in C, there are\n    many ooportunities for Perl developers to add value.\n\n    Patrick LeBoutier for example has written a module to read and make\n    available the Nagios configuration for other applications.\n\n    Thank you,\n\n    Yours sincerely."
   },
   "meta" : {
      "message_id" : "200306150919.h5F9J8oR030104@pause.perl.org",
      "epoch" : 1055668748,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission Nagios::WebTransact",
      "file" : "21821.txt",
      "type" : "module_submission"
   }
}
