{
   "data" : {
      "userid" : {
         "name" : "Anthony G Persaud",
         "id" : "APERSAUD"
      },
      "description" : "parse nmap xml-output data easily (-oX)",
      "communities" : "",
      "chapterid" : {
         "name" : "String_Lang_Text_Proc",
         "id" : "11"
      },
      "similar" : "",
      "DSLIP" : "RdpOa",
      "modid" : "Parse::Nmap::XML",
      "enteredon" : "Thu Jul 10 18:00:47 2003 GMT",
      "enteredby" : {
         "name" : "Anthony G Persaud",
         "id" : "APERSAUD"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "This is not a root namespace. The Parse::* namespace exists. The\n    reason for the namespace is Parser::Nmap is such that Nmap can\n    output various formats from its scans. Parse::Nmap::XML can handle\n    the xml-output format produced by nmap version 3.00+. Hopefully,\n    other users (or I if I have time) can write other parsers to\n    different types of nmap output such as Parse::Nmap::Normal,\n    Parse::Nmap::Greppable (etc).\n\n    This module is a standalone parser for the xml-output. Sometimes\n    you don't want to parse the output data directly piped from an nmap\n    command (but this feature is available handled in the module also).\n    Instead, you can have various nmap scans that run over night that\n    are saved into xml files (or 1 huge one), and you can write a perl\n    script using this module to effectively parse these files using the\n    XML::Twig library (which makes it efficient to parse large XML\n    files) and take the information which is easy to access, and put it\n    in a mysql database (for example).\n\n    An example of the usefulness of this module is (real-life\n    application) is having an nmap scan that goes through large subnets,\n    fingerprinting machines for os, services, hostnames..etc, saves all\n    this information to an xml file format. The parsing of this xml\n    (large) file can be done with this module, and the information can\n    then be placed into a mysql network database that can be accessed by\n    other applications"
   },
   "meta" : {
      "message_id" : "200307101800.h6AI0mjD027117@pause.perl.org",
      "epoch" : 1057860048,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission Parse::Nmap::XML",
      "file" : "22321.txt",
      "type" : "module_submission"
   }
}
