{
   "data" : {
      "userid" : {
         "name" : "Earl Cahill",
         "id" : "EARL"
      },
      "description" : "helps sort, paginate and display results set",
      "communities" : "",
      "chapterid" : {
         "name" : "Data_Type_Utilities",
         "id" : "6"
      },
      "similar" : "",
      "DSLIP" : "MdpOp",
      "modid" : "Data::ResultsHelper",
      "enteredon" : "Tue Jul 15 06:35:43 2003 GMT",
      "enteredby" : {
         "name" : "Earl Cahill",
         "id" : "EARL"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Takes an array of arrays (which is a rather general structure for\n    results sets), allows you to specify how many results per page,\n    simple templates, sort specifications (numeric, ascii, regex out\n    what to sort on, ascending or descending, multiple columns, uses my\n    Sort::ArrayOfArrays), and outputs pages of results as per the sort\n    order and the templates. A table of contents (like google 1, 2, 3,\n    etc for pages of results and back and next links) with navigation is\n    also generated.\n\n    Data::ResultsHelper takes an array of results and returns a hash\n    ref which can then be passed to Template::Toolkit, HTML::Template or\n    the like, or to my Data::ResultsHelper::HTML.\n\n    An earlier, messier version is used at my work to help display log\n    files, result sets from sql queries, our webmail system, our\n    shopping cart system, and countless other places. These utilities\n    have been developed by me and several other engineers.\n\n    A later version will allow results to be filtered, i.e., each\n    column can be included or excluded depending on <, >, =, or a regex.\n    I just haven't yet ported this code.\n\n    An example, which uses Template::Toolkit, can be seen here\n\n    http://spack.net/cgi-bin/tt?page=r2h.htm\n\n    I earlier applied for Data::Results2HTML, but this is a better,\n    cleaner architecture."
   },
   "meta" : {
      "message_id" : "200307150635.h6F6ZiAI018745@pause.perl.org",
      "epoch" : 1058250944,
      "from" : "upload@pause.x.perl.org",
      "subject" : "Module submission Data::ResultsHelper",
      "file" : "22364.txt",
      "type" : "module_submission"
   }
}
