{
   "data" : {
      "userid" : {
         "name" : "Andrew Sterling Hanenkamp",
         "id" : "HANENKAMP"
      },
      "description" : "Write-once/use-anywhere style persistence.",
      "communities" : "http://contentment.sourceforge.net/",
      "chapterid" : {
         "name" : "Database_Interfaces",
         "id" : "7"
      },
      "similar" : "Persistent",
      "DSLIP" : "ampOb",
      "modid" : "Persist",
      "enteredon" : "Wed Jul 23 05:40:58 2003 GMT",
      "enteredby" : {
         "name" : "Andrew Sterling Hanenkamp",
         "id" : "HANENKAMP"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "First, I'm not stuck on the name Persist. It's just the one I've\n    stuck to because I really couldn't find anything that was more\n    descriptive or appropriate. In fact, I didn't even start with this\n    name. The original name I chose was Persistent. I made this choice\n    partly because the existing Persistent was so similar and partly\n    because Persistent seems to be the best descriptive term available.\n\n    However, I switched away to Persist to avoid conflicting with\n    Persistent as it has very similar functionality and some similar\n    package names. I originally tried to contact the author of those\n    modules, DWINTERS, but was unable to get any response to my emails\n    on the possibility of merging my ideas into his modules. That is one\n    reason for the new project.\n\n    Other than that, I've agonized quite a bit over the choice of the\n    name Persist and several times about why I needed a module separate\n    from Persistent. However, the differences between Persist and\n    Persistent are too great to be reconciled. Both Persistent and\n    Persist present a unified Perl API for accessing their back-ends.\n    Both provide access to table schema for the creation of new tables\n    or whatever storage abstraction the back-end provides.\n\n    However, Persist also provides a filtering language that is used to\n    query all back-ends. Persistent uses the back-end's own query\n    language. Persist translates its query language into the native\n    language of the back-end. The query language is based upon SQL to\n    make common drivers easy to write (no or almost no translation) and\n    because SQL tends to be easy to understand and easy to parse.\n\n    Further, Persist provides more than just table schema, but also to\n    database instances. Persist allows for the creation and destruction\n    of new back-ends through a simplified interface. Finally, types are\n    provided through the use of constants in Persist rather than objects\n    in Persistent.\n\n    The Persist library is made up of 10 modules under Persist:\n    Persist, Persist::Driver, Persist::Driver::DBI,\n    Persist::Driver::DBI::PostgreSQL, Persist::Driver::Memory,\n    Persist::Filter, Persist::Join, Persist::Source, Persist::Table, and\n    Persist::Tabular. More classes will be added under Persist::Driver\n    as more drivers are implemented.\n\n    I would rather have named Persist as Persistent, but that, I feel,\n    would conflict with that namespace and create confusion since both\n    ideas are similar--perhaps I'm wrong as I have not paid too much\n    attention to the Perl modules lists. I would probably rather the\n    name be Persisting as Persisting::Source has a much nicer ring to\n    it.\n\n    I've chosen a rootlevel namespace because I couldn't find an\n    existing namespace that made more sense to me. I searched quite a\n    bit, but didn't find one. I'd be more than happy to stick Persist\n    somewhere in particular if it does make sense to. However, Persist\n    has an almost proprietary feel to it's API since it is rather\n    specialized, so a rootlevel seems to make sense anyway--but I'm\n    still not completely sold on any direction.\n\n    I'm working this project primarily as a means of supporting another\n    (described at http://contentment.sf.net/), so the name isn't really\n    important to me."
   },
   "meta" : {
      "message_id" : "200307230541.h6N5f1Y7027196@pause.perl.org",
      "epoch" : 1058938861,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Persist",
      "file" : "22482.txt",
      "type" : "module_submission"
   }
}
