{
   "data" : {
      "userid" : {
         "name" : "Paul Golds",
         "id" : "MOLT"
      },
      "description" : "Interface to the Cg shader language.",
      "communities" : "sdlperl.org mailing list.",
      "chapterid" : {
         "name" : "Language_Interfaces",
         "id" : "9"
      },
      "similar" : "SDL::OpenGL (Provides an interface to OpenGL, SDL::OpenGL::Cg\n    expands on this to allow access to the shader facilities of newer\n    graphics cards).",
      "DSLIP" : "cdcfp",
      "modid" : "SDL::OpenGL::Cg",
      "enteredon" : "Thu Aug 14 15:58:45 2003 GMT",
      "enteredby" : {
         "name" : "Paul Golds",
         "id" : "MOLT"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "It provides a useful functionality by allowing Perl graphics and\n    games programmers to take more complete advantage of their graphics\n    cards by providing an XS-based interface to nVidia's Cg and CgGL\n    libraries. This should allow them to equal the quality of images\n    that C/C++ programmers already have access to from the library.\n\n    I personally use SDL::OpenGL for my OpenGL interface, and as such\n    whilst SDL::OpenGL::Cg may potentially work with other OpenGL\n    interfaces SDL::OpenGL is the one it's being targetted at and\n    primarily supported for. This is why I'm writing it as\n    SDL::OpenGL::Cg and not OpenGL::Cg or someother such related module.\n    As yet I can't think of anything tying it with SDL::OpenGL's\n    functionality, but I would be surprised if it remained that way for\n    the module's lifetime. The author of SDL::OpenGL has also been\n    informed of the choice of namespace and expressed no objections.\n\n    Whilst the module is still only providing a subset of the C API it\n    is already useable, and useful, proving that the project can be a\n    long-term technical success in marrying these two languages\n    together."
   },
   "meta" : {
      "message_id" : "200308141558.h7EFwkmt027608@pause.perl.org",
      "epoch" : 1060876726,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission SDL::OpenGL::Cg",
      "file" : "22888.txt",
      "type" : "module_submission"
   }
}
