{
   "data" : {
      "userid" : {
         "name" : "W. Phillip Moore",
         "id" : "WPMOORE"
      },
      "description" : "OO Wrapper APIs for the AFS CLI utilities",
      "communities" : "openafs-devel@openafs.org",
      "chapterid" : {
         "name" : "File_Names_Systems_Locking",
         "id" : "10"
      },
      "similar" : "AFS",
      "DSLIP" : "bdpOp",
      "modid" : "AFS::Command",
      "enteredon" : "Mon Aug 25 20:47:23 2003 GMT",
      "enteredby" : {
         "name" : "W. Phillip Moore",
         "id" : "WPMOORE"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "The existing AFS modules are XS wrappers for the low level AFS C\n    APIs. These modules are powerful, and they provide an interface for\n    the a subset of the administrative functions in AFS. However, this\n    approach has some holes -- some of the most important administrative\n    functions are coded not in any library, but in the command line\n    utilities that manage AFS (namely the vos and bos utilities).\n\n    My new API is an OO wrapper around these command line utilities,\n    and they provide a complimentary set of modules that allow the\n    development of systems management utilities for AFS. Since an XS\n    implementation of the \"vos\" utility (by far the most critically\n    important one) isn't feasible without a significant rearchitecture\n    of the OpenAFS code, this module fills the existing gap by\n    leveraging the parseability of the vos command output.\n\n    This new suite of modules compliments and coexists with the\n    existing AFS module(s), and fills an huge gap that exists in the\n    current functionality available to AFS admininstrators developing\n    management utilities in perl."
   },
   "meta" : {
      "message_id" : "200308252047.h7PKlOMp012853@pause.perl.org",
      "epoch" : 1061844444,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission AFS::Command",
      "file" : "23101.txt",
      "type" : "module_submission"
   }
}
