{
   "data" : {
      "userid" : {
         "name" : "Sam Tregar",
         "id" : "SAMTREGAR"
      },
      "description" : "validate XML with a subset of W3C XML Schema",
      "communities" : "perl-xml, my use.perl journal",
      "chapterid" : {
         "name" : "String_Lang_Text_Proc",
         "id" : "11"
      },
      "similar" : "XML::Schema, XML::Xerces",
      "DSLIP" : "adpOp",
      "modid" : "XML::Validator::Schema",
      "enteredon" : "Tue Sep  9 01:37:55 2003 GMT",
      "enteredby" : {
         "name" : "Sam Tregar",
         "id" : "SAMTREGAR"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "I'm writing a piece of software which uses Xerces/C++\n    (http://xml.apache.org/xerces-c/ ) to validate documents against XML\n    Schema schemas. This works very well, but I'd like to release my\n    project to the world. Requiring users to install Xerces is simply\n    too onerous a requirement; few will have it already and the Xerces\n    installation system leaves much to be desired.\n\n    On CPAN, the only available XML Schema validator is XML::Schema.\n    Unfortunately, this module isn't ready for use as it lacks the\n    ability to actually parse the XML Schema document format! I looked\n    into enhancing XML::Schema but I must admit that I'm not smart\n    enough to understand the code... One day, when XML::Schema is\n    completed I will replace this module with a wrapper around it.\n\n    This module represents my attempt to support enough XML Schema\n    syntax to be useful without attempting to tackle the full standard.\n    I'm sure this will mean that it can't be used in all situations, but\n    hopefully that won't prevent it from being used at all.\n\n    My orignal name for the module was XML::SchemaValidator, but I was\n    persuaded by the perl-xml denizens to put it under XML::Validator::.\n    Others on the list dream of the day when a multitude of XML\n    validators are available and a compatible API can be worked out at\n    the XML::Validator level."
   },
   "meta" : {
      "message_id" : "200309090137.h891bwDl018500@pause.perl.org",
      "epoch" : 1063071478,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission XML::Validator::Schema",
      "file" : "23433.txt",
      "type" : "module_submission"
   }
}
