{
   "data" : {
      "userid" : {
         "name" : "Thomas Dorner",
         "id" : "DORNER"
      },
      "description" : "access BS2000 LMS libraries",
      "communities" : "perl-mvs (at) perl.org",
      "chapterid" : {
         "name" : "Operating_System_Interfaces",
         "id" : "4"
      },
      "similar" : "Archive::Ar",
      "DSLIP" : "adhOp",
      "modid" : "BS2000::LMS",
      "enteredon" : "Thu Sep 25 05:32:00 2003 GMT",
      "enteredby" : {
         "name" : "Thomas Dorner",
         "id" : "DORNER"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "The BS2000 Library Management System allows a BS2000 users to put\n    files together in libraries, a bit similar to the ar archive program\n    on Unix machines. As native BS2000 only has a flat file system\n    (Volume, User, Filename) this is heavily used. If you use the\n    Unix-like Posix subsystem on BS2000 (which has a Unix file system as\n    well) you can copy files to and from native BS2000 LMS libraries,\n    but that's all, you can't even access the table of contents.\n    Fortunately LMS has a C API and this is where this module comes in.\n    It will allow a BS2000 user to access LMS libraries and their\n    elements from native BS2000 and the Posix subsystem alike using a\n    Perl script. At the moment only access to the table of contents and\n    copying elements to and from libraries are implemented, but\n    additional methods (like direct reading and writing) are planned for\n    the future.\n\n    As this module will only compile on BS2000 machines I think a new\n    rootlevel namespace (like MVS:: and all the other machine specific\n    namespaces) should be in order.\n\n    Thomas"
   },
   "meta" : {
      "message_id" : "200309250532.h8P5W0KL023344@pause.perl.org",
      "epoch" : 1064467920,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission BS2000::LMS",
      "file" : "23705.txt",
      "type" : "module_submission"
   }
}
