{
   "data" : {
      "userid" : {
         "name" : "Dana Hudes",
         "id" : "DHUDES"
      },
      "description" : "webserver abuse detection system",
      "communities" : "Original concept presented at Stevens Institute of Technology, where\n    I am a Ph.D student, for course project in Computer Network Security\n    class",
      "chapterid" : {
         "name" : "World_Wide_Web_HTML_HTTP_CGI",
         "id" : "15"
      },
      "similar" : "Apache::BruteWatch has the germ of the idea but is tied to mod_perl\n    and doesn't do anything about its findings except send email to the\n    sysadmin",
      "DSLIP" : "cdpOg",
      "modid" : "HTTPD::ADS",
      "enteredon" : "Sun Oct 26 05:08:32 2003 GMT",
      "enteredby" : {
         "name" : "Dana Hudes",
         "id" : "DHUDES"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Hackers are continually abusing web servers. Worms such as CodeRed,\n    brute force breakin scripts via anonymous proxies such as 'Hammer',\n    password sharing / trading and so on. Various 'abuse detection'\n    scripts exist here and there usually to detect password sharing.\n    'Intrusion Detection Systems' typically work at the IP packet level.\n    Its not just \"pay sites\" that are at risk. Medical data for drug\n    studies is now collected by pharmaceutical companies via web\n    interfaces that are password-protected.\n\n    when hackers try to break in a typical brute force attack is 5000\n    automated username/password attempts via each of 20-30 proxy\n    machines -- at the same time. This uses bandwidth on the network,\n    the disk subsystem to write useless log entries and of course cpu\n    and other computer resources (even electricity!).\n\n    This is the beginning of a tool intended to stop web-level breakin\n    attempts in their tracks and at the same time put the operator of\n    the network from which the attack originates on notice. Future\n    versions of this system are intended to share result with users of\n    this systems on other hosts -- in effect issuing a \"shoot on sight\"\n    order (i.e. block this host before it can attack you)."
   },
   "meta" : {
      "message_id" : "200310260508.h9Q58XOO005622@pause.perl.org",
      "epoch" : 1067144913,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission HTTPD::ADS",
      "file" : "24201.txt",
      "type" : "module_submission"
   }
}
