{
   "data" : {
      "userid" : {
         "name" : "Bjarne Steinsbo",
         "id" : "STEINSBO"
      },
      "description" : "Units of measurement as used in petrophysics",
      "communities" : "ospetro-discussion@lists.sourceforge.net",
      "chapterid" : {
         "name" : "Miscellaneous_Modules",
         "id" : "23"
      },
      "similar" : "Math::Unit, Physics::Unit",
      "DSLIP" : "bdpOp",
      "modid" : "Petrophysics::Units",
      "enteredon" : "Sun Oct 26 19:26:41 2003 GMT",
      "enteredby" : {
         "name" : "Bjarne Steinsbo",
         "id" : "STEINSBO"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Namespace choice: Difficult to defend \"Petrophysics\" since I'm not\n    a 100% certain myself if this is the best choice. The choice has\n    more to do with traditions in the old, big, rich, specialized\n    science/engineering-based petroleum industry than logic and a desire\n    to define it as \"just applied geophysics\". Additionally, handling\n    units of measurement is more fundamental than petrophysics, so the\n    two parts of the name should perhaps be reversed...\n\n    Maybe \"Physics::Geo::Applied::Units::Petroleum_industry\" is a\n    \"better\" choice, but as far as I know there is no accepted\n    classification for the different sciences. I do know that quite a\n    few chemists will get upset if you try to argue that chemistry is\n    \"just applied physics\".\n\n    Uniqueness of my approach: The other unit manipulation modules are\n    mainly doing just that, manipulating the units of measurement. This\n    module will work off an existing database of units (ca. 2000 units\n    defined by POSC), and only do conversion of measured data from one\n    unit to another. It's not able to do manipulation of the units as\n    such at all.\n\n    It's the difference between saying that a speed is a length divided\n    by time, and converting between miles/hour and meters/second. OK, it\n    must be admitted that Physics::Unit also do limited conversion, but\n    its algorithm for doing this is so \"primitive\" that it can't work\n    with a unit like \"degrees Fahrenheit\". It's only using a conversion\n    factor (y = Ax) (and it's not a trivial change to fix that) whereas\n    this module is converting using four different factors by the\n    formula y = (A + Bx)/(C + Dx). So where Physics::Unit is failing to\n    convert between Kelvin and Fahrenheit because there is an offset,\n    this module will even allow you to convert between \"meters per\n    second\" and \"microsecond per foot\" (note the reciprocal).\n    Extravagant/stupid (and should not be allowed)? Yes, but exactly\n    that conversion is needed by the petroleum industry for acoustic\n    logs."
   },
   "meta" : {
      "message_id" : "200310261926.h9QJQgGH013635@pause.perl.org",
      "epoch" : 1067196402,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Petrophysics::Units",
      "file" : "24211.txt",
      "type" : "module_submission"
   }
}
