{
   "data" : {
      "userid" : {
         "name" : "Daniel Allen",
         "id" : "DALLEN"
      },
      "description" : "Draw TrueType text around edge of circle",
      "communities" : "will be discussed in kw.pm / to.pm mailing lists, possibly perlmonks",
      "chapterid" : {
         "name" : "Images_Pixmaps_Bitmaps",
         "id" : "18"
      },
      "similar" : "",
      "DSLIP" : "adpOp",
      "modid" : "GD::Text::Arc",
      "enteredon" : "Fri Nov  7 22:45:49 2003 GMT",
      "enteredby" : {
         "name" : "Daniel Allen",
         "id" : "DALLEN"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "GD can draw truetype text at any angle in a straight line. However,\n    to draw text along a curve (such as around the top or bottom of a\n    circle), one must invest some time to make the math work out\n    correctly, as there are no existing modules to do that\n    automatically. The math is not difficult at all, but getting the\n    angles and signs correct can be tricky.\n\n    This module currently draws text to follow a circular arc.\n    Parameters include: GD image object, font-name, size, text, x and y\n    position of circle origin, angle, justification, and orientation.\n    The angle can either be the starting angle on the circle, or the\n    center of the text (depending on the justification). Justification\n    is either left- or center. Orientation can be clockwise or\n    counterclockwise (as would be natural for at the top or bottom of\n    the circle, respectively). I plan to eventually add \"x-axis\" and\n    \"y-axis\" to allow the arc to follow an ellipse as well.\n\n    Namespace:\n\n    GD::Text::Arc is as simple and straight-forward a name as any other\n    I have considered. Possible names I've considered and rejected:\n\n    GD::Text::Wrap::Circle (rejected because it doesn't wrap text\n    inside a circle, as you might expect by the superclass)\n\n    GD::Text::Path::Arc (appropriate if somebody was going to write the\n    superclass, to follow arbitrary shapes. But the name doesn't sound\n    as clean.)\n\n    GD::Text::Circular (alternative name; would be OK but it doesn't\n    sound as clean.)"
   },
   "meta" : {
      "message_id" : "200311072245.hA7MjrOY018896@pause.perl.org",
      "epoch" : 1068245153,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission GD::Text::Arc",
      "file" : "24422.txt",
      "type" : "module_submission"
   }
}
