{
   "data" : {
      "userid" : {
         "name" : "Paul Timmins",
         "id" : "PTIMMINS"
      },
      "description" : "Sends Net Alerts to Cell Phone Web Browsers",
      "communities" : "",
      "chapterid" : {
         "name" : "Networking_Devices_IPC",
         "id" : "5"
      },
      "similar" : "Net::SMS Net::SMPP Net::SNPP",
      "DSLIP" : "cdpOp",
      "modid" : "Net::UP::Notify",
      "enteredon" : "Sun Nov  9 16:37:46 2003 GMT",
      "enteredby" : {
         "name" : "Paul Timmins",
         "id" : "PTIMMINS"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "The reason I chose Net::UP::Notify is that there are modules\n    (Net::SMS, NET::SMPP, and NET::SNPP) that do similar things to what\n    my module does under the Net namespace already. I chose UP because\n    the original browser in the cellular phone was made by a company\n    called \"Unwired Planet\", which has become \"phone.com\", and now\n    \"Openwave\" through acquisitions. I would rather not use phone.com or\n    Openwave because of trademark concerns and because Openwave still\n    calls their SDK (which is binary and requires Windows or Solaris)\n    the \"UP SDK\". Openwave already distributes a perl module via their\n    SDK that allows you to send Net Alerts, but the caveat in their\n    approach is that it runs in Windows only, and uses COM Automation of\n    a DLL from ActivePerl. Since this is incredibly not portable, I\n    reverse engineered the format and made a version that simply\n    requires LWP::UserAgent. I intend to eventually fully support a\n    portable version of the SDK under the Net::UP tree, but for now I\n    just have Net::UP::Notify. I wish I could retain interface\n    compatibility with their example code, but it's so broken and\n    convoluted because of the DLL automation that it would be\n    impossible.\n\n    Anyway, that's the story. :-)"
   },
   "meta" : {
      "message_id" : "200311091637.hA9GblmL009609@pause.perl.org",
      "epoch" : 1068395867,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Net::UP::Notify",
      "file" : "24449.txt",
      "type" : "module_submission"
   }
}
