{
   "data" : {
      "userid" : {
         "name" : "Brad Lhotsky",
         "id" : "BLHOTSKY"
      },
      "description" : "Abstracts forking code out of the program",
      "communities" : "",
      "chapterid" : {
         "name" : "Networking_Devices_IPC",
         "id" : "5"
      },
      "similar" : "Parallel::ForkManager",
      "DSLIP" : "adpOp",
      "modid" : "Parallel::ForkControl",
      "enteredon" : "Mon Dec  8 23:28:01 2003 GMT",
      "enteredby" : {
         "name" : "Brad Lhotsky",
         "id" : "BLHOTSKY"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "The goal of the module is to have a smart parent process that can\n    stop forking processes when the machine comes under heavy load,\n    either from the children, or other external programs. Additionally,\n    it encapsulates the child program in a sub routine, making code look\n    a little cleaner, and slightly more maintainable. As of right now,\n    the code I have can only control the start of processes, eventually,\n    I'd like to extend the module to be able to control children\n    currently running, perhaps enabling the parent process to suspend or\n    terminate children based on the health of the system. The interface\n    is very generic at this point, it uses 'uptime' as a way to\n    calculate the system load. As I get more feedback, I'd like to make\n    the build process determine the best way to monitor processes. For\n    instance, if /proc is available, I might have a /proc related\n    process manager to utilize as opposed to shell commands or\n    something. I'd like to give the developer more control over their\n    child processes and remove all the fork logic from the program. The\n    end result SHOULD be less fork bombed servers."
   },
   "meta" : {
      "message_id" : "200312082328.hB8NS2T4022639@pause.perl.org",
      "epoch" : 1070926082,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Parallel::ForkControl",
      "file" : "24931.txt",
      "type" : "module_submission"
   }
}
