{
   "data" : {
      "userid" : {
         "name" : "Mark Shelor",
         "id" : "MSHELOR"
      },
      "description" : "Helix Used as a Pure MAC Function",
      "communities" : "comp.lang.perl.modules",
      "chapterid" : {
         "name" : "Security_and_Encryption",
         "id" : "14"
      },
      "similar" : "Digest",
      "DSLIP" : "adchp",
      "modid" : "Digest::Helix",
      "NB" : "the authors of Helix \"explicitly release any intellectural",
      "enteredon" : "Sun Dec 21 06:00:36 2003 GMT",
      "enteredby" : {
         "name" : "Mark Shelor",
         "id" : "MSHELOR"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "The Helix stream cipher and MAC function are gaining increasing\n    interest in the cryptographic community since the publication of the\n    Ferguson, Schneier, et al. paper defining this new algorithm.\n    Currently, there is no Helix support whatsoever within CPAN. The\n    Digest::Helix module would provide a convenient way for\n    cryptographers to conduct further research into this algorithm. It's\n    also conjectured that this module would provide Perl users with one\n    of the fastest ways to compute cryptographically strong message\n    digests.\n\n    I am the author of the Digest::SHA module, which fully complies\n    with all OO interface guidelines established in the Digest:: module.\n    The Digest::Helix module would also fit these same guidelines,\n    thereby making its operation very easy to understand for CPAN Digest\n    users.\n\n    NB: the authors of Helix \"explicitly release any intellectural\n    property rights to Helix into the public domain.\" The CPAN\n    implementation would be released under the standard Perl license."
   },
   "meta" : {
      "message_id" : "200312210600.hBL60bD4030487@pause.perl.org",
      "epoch" : 1071986437,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Digest::Helix",
      "file" : "25197.txt",
      "type" : "module_submission"
   }
}
