{
   "data" : {
      "userid" : {
         "name" : "Justin Michael Bauman",
         "id" : "SAINTMARK"
      },
      "description" : "Implementation of the Fusker URL syntax.",
      "communities" : "#perl on irc.perl.org",
      "chapterid" : {
         "name" : "World_Wide_Web_HTML_HTTP_CGI",
         "id" : "15"
      },
      "similar" : "",
      "DSLIP" : "adpOp",
      "modid" : "Fusker",
      "enteredon" : "Tue Jan  6 18:04:28 2004 GMT",
      "enteredby" : {
         "name" : "Justin Michael Bauman",
         "id" : "SAINTMARK"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Fusker is quickly becoming a major concept in content discovery on\n    the World Wide Web. It began as an open source project, which was\n    unfortunately abandoned with very few copies of the code made\n    available. The heart of fusker is a simple syntax for embedding\n    ranges in URLs which can then be expanded to create a list of\n    similar URLs. Currently only a commercial, closed-source\n    implementation of this concept and syntax exists. I wish to return\n    fusker to the masses and to it's beginnings as a completely free\n    implementation, both financially and intellectually. The URL syntax\n    itself is very simple, however, used properly it provides a powerful\n    method of exchanging a large number of pointers to documents on the\n    web in a single URL. I want to use this namespace to provide an\n    efficient implementation of the concepts involved, creating and\n    expanding these URLs. As well as other future syntaxes related in\n    concept. Also I would like to provide implementations of this\n    concept both as a web program as well as examples of use in other\n    applications."
   },
   "meta" : {
      "message_id" : "200401061804.i06I4Vrj003984@pause.perl.org",
      "epoch" : 1073412271,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Fusker",
      "file" : "25403.txt",
      "type" : "module_submission"
   }
}
