{
   "data" : {
      "userid" : {
         "name" : "Pratheepan Raveendranathan",
         "id" : "PRATH"
      },
      "description" : "GoogleHack tool kit",
      "communities" : "Maling Lists, CVS repository",
      "chapterid" : {
         "name" : "World_Wide_Web_HTML_HTTP_CGI",
         "id" : "15"
      },
      "similar" : "",
      "DSLIP" : "adpOg",
      "modid" : "GoogleHack",
      "enteredon" : "Fri Jan  9 16:48:36 2004 GMT",
      "enteredby" : {
         "name" : "Pratheepan Raveendranathan",
         "id" : "PRATH"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Google-Hack is a Perl package that does a number of interesting\n    things using the Google API. The package interacts with Google,\n    retrives query results, and has the ability to do basic Natural\n    Language Processing. To The idea behind this package is basically to\n    be able to use the web as a source for doing natural language\n    processing. Currently the package uses google as the source to the\n    web, and can predict the semantic orientation of paragraphs, and the\n    relatedness between two words etc. This in turn allows others\n    interested in using the web as a source for NLP to have access to\n    functions that do the simple act of retrieving measures, doing\n    queries etc.\n\n    The namespace Google-hack was chosen, since we are using the Google\n    API, and we are performing two tasks. One, we are allowing the user\n    to use the basic API functions in an easy to use format. Two, we are\n    allowing a little bit more interesting applications of the Google\n    API.\n\n    The package is at its early stages, but is in a form ready to be\n    released, but is still under active development and testing. For\n    more information on the package, and to download its current\n    version:\n\n    http://google-hack.sourceforge.net\n\n    Since the package is written in PERL we beleive that it is\n    important to release it via CPAN."
   },
   "meta" : {
      "message_id" : "200401091648.i09Gmk9U024551@pause.perl.org",
      "epoch" : 1073666926,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission GoogleHack",
      "file" : "25461.txt",
      "type" : "module_submission"
   }
}
