{
   "data" : {
      "homepage" : "",
      "userid" : "JOHNW",
      "fullname" : "John Nicholas Whitley",
      "why" : "Firstly I'd like to contribute my Bachelor's final project (read\n    disertation), which is a website development suite.\n\n    In essence, it's has become bad practice to mix presentation and\n    functional code, like PHP or ASP currently do. One implementation of\n    this system is JSP Servlet on Apache-Tomcat, but I chose to develop\n    in Perl - for mod-perl, partly because I was unaware of JSP when I\n    first designed my framework.\n\n    As well as the framework, I also developed some tools to make site\n    development easier - if you want to link functional webpages\n    together, you almost certainly want to pass data between them, and\n    have some flow control. I developed a couple of perl tools to take\n    the laborieus parts of implementing this away. You still have to\n    develop the code once the basic pages are there - however, it might\n    be nice to develop an additional tool to make this more complete,\n    and it would therefore be easy to document.\n\n    I have developed the framework to have interchangeable templates;\n    for example, if your browser requests an html document, the\n    framework uses the html template for that page, if the browser\n    requests a wap page, the browser uses the wap template, ad\n    infinitum. I have left the hands in the framework to do this with\n    XSLT, so the developer has the choice of using XML-XSLT transforms,\n    or \"static\" templates.\n\n    Anyway, I have a basic working framework, which could use some\n    further development to incorporate XSLT functionality. As it stands\n    the code is functional (needs to be \".tar.gz\"ed and needs a nice\n    makefile).\n\n    I am also interested in generally helping any perl project that may\n    be in need of another pair of eyes.\n\n    I would like to put something back into CPAN, having taken a lot\n    away from the Perl community and CPANs exstensive libraries over the\n    last three years.\n\n    Thanks for your time,\n\n    John Whitley PhD Student, Loughborough University, UK.",
      "mail" : "CENSORED"
   },
   "meta" : {
      "message_id" : "200401111504.i0BF4TXf021646@pause.perl.org",
      "epoch" : 1073833469,
      "from" : "upload@pause.perl.org",
      "subject" : "PAUSE ID request (JOHNW; John Nicholas Whitley)",
      "file" : "25506.txt",
      "type" : "pause_id_request"
   }
}
