{
   "data" : {
      "userid" : {
         "name" : "David Wheeler",
         "id" : "DWHEELER"
      },
      "description" : "Parameter-triggered callback architecture",
      "communities" : "bricolage-devel@lists.sourceforge.net",
      "chapterid" : {
         "name" : "Opt_Arg_Param_Proc",
         "id" : "12"
      },
      "similar" : "Params::Validate",
      "DSLIP" : "RdpOp",
      "modid" : "Params::CallbackRequest",
      "enteredon" : "Sat Jan 17 01:16:54 2004 GMT",
      "enteredby" : {
         "name" : "David Wheeler",
         "id" : "DWHEELER"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Params::CallbackRequest provides functional and object-oriented\n    callbacks to method and function parameters. Callbacks can either be\n    \"request callbacks,\" triggered for every call to the request()\n    method; or can be triggered by special parameter hash key names.\n    Although potentially useful in any Perl application,\n    Params::CallbackRequest was designed to be used with web\n    applications, where the parameters submitted by the browser may be\n    configured specifically to trigger callbacks on the server.\n\n    This module takes an important piece of\n    MasonX::ApacheHandler::WithCallbacks (which is deprecated), and\n    generalizes it for use with other templating architectures, or\n    indeed with any context that processes parameter arguments. Although\n    Params::Validate also offers callbacks on parameter arguments, it\n    does so purely for validation. Params::CallbackRequest, OTOH, is\n    designed for creating callbacks that drive a user interface, such as\n    those created by various Perl templating systems.\n\n    The \"Request\" part of the namespace indicates that the module is\n    used to process any requested callbacks in a single call to the the\n    function or method that needs its parameters analyzed for callbacks.\n    The Params::Callback namespace, on the other hand, represents a\n    single instance of a callback object. I'd like to register that\n    namespace, as well."
   },
   "meta" : {
      "message_id" : "200401170116.i0H1GtZf022455@pause.perl.org",
      "epoch" : 1074302216,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Params::CallbackRequest",
      "file" : "25619.txt",
      "type" : "module_submission"
   }
}
