{
   "data" : {
      "userid" : {
         "name" : "Stephen Adkins",
         "id" : "SPADKINS"
      },
      "description" : "Parse/validate opts from ARGV, env, files",
      "communities" : "p5ee@perl.org",
      "chapterid" : {
         "name" : "Opt_Arg_Param_Proc",
         "id" : "12"
      },
      "similar" : "AppConfig Getopt::Long",
      "DSLIP" : "RdpOp",
      "modid" : "App::Options",
      "enteredon" : "Mon Jan 19 15:31:30 2004 GMT",
      "enteredby" : {
         "name" : "Stephen Adkins",
         "id" : "SPADKINS"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "App::Options was chosen as the module name because (naturally) it\n    allows for options to be set for perl applications. It allows\n    command line options, environment variables, and configuration files\n    to be used to set these options. It is a prerequisite for other\n    pre-alpha modules being developed in the App::* namespace for the\n    P5EE project.\n\n    It is different than most of the Getopt::* modules because it\n    integrates the processing of command line options, environment\n    variables, and config files.\n\n    It is different from AppConfig (to which its description bears the\n    most resemblance) by its ability to configure a suite of programs\n    with a cascading set of configuration files. This allows for a large\n    number of programs in a large software system to share a small set\n    of configuration files. Some of the option values may be shared, and\n    some may be targetted at a single program or a pattern-matched set\n    of programs. Furthermore, its special treatment of the \"perlinc\"\n    option facilitates the inclusion (\"use\") of application-specific\n    perl modules from special places to enable the installation of\n    multiple versions of an application on the same system (i.e.\n    /usr/mysystem/version).\n\n    App::Options is also the easiest command-line processing system\n    that I have found anywhere. Then it provides a smooth transition to\n    more advanced features only as they are needed."
   },
   "meta" : {
      "message_id" : "200401191531.i0JFVX5q030119@pause.perl.org",
      "epoch" : 1074526293,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission App::Options",
      "file" : "25782.txt",
      "type" : "module_submission"
   }
}
