{
   "data" : {
      "homepage" : "",
      "userid" : "BHARB",
      "fullname" : "Bane Harbinger",
      "why" : "NCustom version 0.04 ====================\n\n    NCustom provides some file editting routines and some package\n    management hooks to assit in system configuration.\n\n    File editting: The file editing routines include features such as\n    transactions, and undo by transaction. The original files are\n    archived within a directory tree structure.\n\n    Package management: You may specify packages (and\n    minumum/maximum/exact versions) that you require to be installed,\n    and a routine to call if they are not installed. Your routine may\n    use simple \"rpm\" commands (or whatever you want), or you may use the\n    provided routine that uses \"apt\". In-built support for other package\n    management tools is on the todo list.\n\n    System configuration: A commandline interface provides for\n    initialisation, configuration, and invocation (including invocation\n    across the network). This enables NCustom to be used from the post\n    section of Kickstart script. It may also be used stand alone on an\n    already built system.\n\n    If system configuration tweaking is minor, then scripts (even in\n    the post section of a kickstart configuration) may be more useful.\n    If the system configuration tweaking is related to only one rpm,\n    then re-rolling the rpm with a new patch/post section may be more\n    useful. If there are several packages that need inter-related\n    configuration (eg building a Samba, PDC, LDAP server), then NCustom\n    may improve the speed of development of automated system\n    configuration.\n\n    #end#",
      "mail" : "CENSORED"
   },
   "meta" : {
      "message_id" : "200401310100.i0V1040G000407@pause.perl.org",
      "epoch" : 1075510804,
      "from" : "upload@pause.perl.org",
      "subject" : "PAUSE ID request (BHARB; Bane Harbinger)",
      "file" : "26928.txt",
      "type" : "pause_id_request"
   }
}
