{
   "data" : {
      "userid" : {
         "name" : "David Golden",
         "id" : "DAGOLDEN"
      },
      "description" : "Module creation with user-defined templates",
      "communities" : "comp.lang.perl.modules, perlmonks.org",
      "chapterid" : {
         "name" : "Development_Support",
         "id" : "3"
      },
      "similar" : "ExtUtils::ModuleMaker",
      "DSLIP" : "bdpOp",
      "modid" : "ExtUtils::ModuleMaker::TT",
      "enteredon" : "Mon Mar  8 00:21:54 2004 GMT",
      "enteredby" : {
         "name" : "David Golden",
         "id" : "DAGOLDEN"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Module Abstract\n\n    ExtUtils::ModuleMaker::TT subclasses ExtUtils::Modulemaker to\n    support user-defined templates using TT - the template toolkit. This\n    allows users to easily customize module creation to suit their own\n    personal coding style. It also supports adding individual .pm (and\n    .t) files to an existing module using the same templates. A new\n    command-line script for module creation is included, which supports\n    loading/saving user defaults (such as AUTHOR) from a configuration\n    file.\n\n    Namespace Rationale:\n\n    This is a subclass of ExtUtils::ModuleMaker. The \"TT\" extension is\n    brief and clear, signaling the use of the Template Toolkit through\n    its standard abbreviation.\n\n    Modulelist Rationale: New modules are critical to the ongoing\n    success of the perl community, yet creating modules is a difficult\n    task for inexperienced developers and a time consuming task for new\n    and experience developers alike. h2xs and ExtUtilsModuleMaker are\n    good tools, but their rigid nature requires extensive hand-tuning of\n    the default files created. ExtUtils::ModuleMaker::TT addresses\n    beginner needs with reasonable defaults while providing power and\n    flexibility to the experienced developer to customize defaults and\n    templates to suit individual style. Inclusion of this module in the\n    module list will assist both new and old developers in finding the\n    module, which, by making module developing an easier task, assist\n    the perl community as a whole."
   },
   "meta" : {
      "message_id" : "200403080021.i280LuVZ000447@pause.perl.org",
      "epoch" : 1078705316,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission ExtUtils::ModuleMaker::TT",
      "file" : "29235.txt",
      "type" : "module_submission"
   }
}
