{
   "data" : {
      "userid" : {
         "name" : "Olaf Kolkman",
         "id" : "OLAF"
      },
      "description" : "DNS Zonefile preparser",
      "communities" : "DNS related mailinglists",
      "chapterid" : {
         "name" : "Networking_Devices_IPC",
         "id" : "5"
      },
      "similar" : "See rationale",
      "DSLIP" : "adpOd",
      "modid" : "Net::DNS::Zone::Parser",
      "enteredon" : "Tue Mar  9 11:11:47 2004 GMT",
      "enteredby" : {
         "name" : "Olaf Kolkman",
         "id" : "OLAF"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "This module implements a pre-parser on which Net::DNS::Zone (in\n    advanced alpha, will be published later) will be based.\n\n    In the package itself I refer to other packages that are related.\n\n    Related packages. There are other packages with likewise\n    functionality; they where not suitable. Before you start using this\n    module you may want to look at these.\n\n    DNS::Zone::File will parse a zonefile but will not expand domain\n    names that are not fully qualified since it has no logic to\n    interpret the RDATA of each individual RR. You can use this module\n    to pre-process the file and then feed it to DNS::Zone::File\n    (Default) to create a DNS::Zone instance.\n\n    DNS::ZoneFile has almost the same functionality as this code it the\n    canonicalises RR records it is aware off. It also has an INCLUDE\n    function. Being an abstraction of a zonefile it has an interface to\n    add and delete RRs from the zonefile and print it. The code does not\n    sup- port a GENERATE feature.\n\n    Net::DNS::ZoneFile has related functionality but failed to load a\n    number of zonefiles.\n\n    I have tried to use these other packages for my purposes but they\n    all failed to parse the zonefiles I provided. I've been looking at\n    bug fixes but that would involve major rewrites of these libraries.\n\n    I'll try to supply a generic and RFC complient module."
   },
   "meta" : {
      "message_id" : "200403091111.i29BBmCV032731@pause.perl.org",
      "epoch" : 1078830708,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Net::DNS::Zone::Parser",
      "file" : "29274.txt",
      "type" : "module_submission"
   }
}
