{
   "data" : {
      "userid" : {
         "name" : "Roel van der Steen",
         "id" : "RST"
      },
      "description" : "A MIF Parser",
      "communities" : "",
      "chapterid" : {
         "name" : "String_Lang_Text_Proc",
         "id" : "11"
      },
      "similar" : "FrameMaker::MIF",
      "DSLIP" : "adpOp",
      "modid" : "FrameMaker::MifTree",
      "enteredon" : "Wed Mar 10 11:31:19 2004 GMT",
      "enteredby" : {
         "name" : "Roel van der Steen",
         "id" : "RST"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "There used to be a MIF parser module on CPAN once, but this seems\n    now discontinued. I wrote a new object class and parser. The RFC for\n    this module got several \"thumbs-up\" when posted on the FrameMaker\n    list at www.adobeforums.com.\n\n    The MIF object is implemented as a Tree::DAG_Node tree object, the\n    parser uses IO::Tokenizer to process the MIF file. It's a pure-perl,\n    clean object-oriented implementation.\n\n    MifTree not only knows the MIF syntax, but it also has some\n    understanding of the allowed structures (within their contexts) and\n    attribute types. This is a unique aspect, as there is no faultless,\n    formal description of the MIF syntax available to the public. The\n    current module supports MIF version 7.00.\n\n    MIF (Maker Interchange Format) is an Adobe FrameMaker file format\n    in ASCII, consisting of statements that create an easily parsed,\n    readable text file of all the text, graphics, formatting, and layout\n    constructs that FrameMaker understands. Because MIF is an\n    alternative representation of a FrameMaker document, it allows\n    FrameMaker and other applications to exchange information while\n    preserving graphics, document content, and format.\n\n    I believe this module can really add to the standardisation of MIF\n    file processing (outside of FrameMaker), and its implementation in\n    Perl makes it possible to write e.g. a MIF to XML convertor."
   },
   "meta" : {
      "message_id" : "200403101131.i2ABVKIO022126@pause.perl.org",
      "epoch" : 1078918280,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission FrameMaker::MifTree",
      "file" : "29325.txt",
      "type" : "module_submission"
   }
}
