{
   "data" : {
      "userid" : {
         "name" : "Will Conant",
         "id" : "LABZERONE"
      },
      "description" : "Dynamic HTML and Text Generation Engine",
      "communities" : "http://groups.yahoo.com/group/tmojo/",
      "chapterid" : {
         "name" : "World_Wide_Web_HTML_HTTP_CGI",
         "id" : "15"
      },
      "similar" : "HTML::Mason Template",
      "DSLIP" : "bmpOo",
      "modid" : "HTML::Tmojo",
      "enteredon" : "Sat Mar 27 01:01:07 2004 GMT",
      "enteredby" : {
         "name" : "Will Conant",
         "id" : "LABZERONE"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "While Tmojo is a complete solution for generating any sort of text\n    document, it is most likely to be used for producing HTML.\n    Consequently, I've decided to put Tmojo in the HTML:: namespace.\n\n    Tmojo is similar to, and in fact somewhat inspired by Mason.\n    Tmojo's primary advantage comes from it's pure Object-Oriented\n    processing model in which Tmojo templates _are_ actual Perl classes,\n    not just similar to Perl classes. Tmojo does borrow some of the\n    clever whitespace handling mechanisms from the Template Toolkit, but\n    it does not aspire to be a complete programming language and relies\n    instead on embedded Perl for template behavior.\n\n    Tmojo also provides a mechanism for \"lite\" templates that cannot\n    run arbitrary Perl code and, thus, can be safely provided by\n    untrusted 3rd parties.\n\n    Tmojo has no dependencies and is not tied, in any way, to mod_perl\n    or CGI and is well suited to text generation needs outside of\n    HTML/CGI. Consequently, the Tmojo interfaces have been designed to\n    be easy to use from any Perl application. Tmojo does, however, come\n    with a mod_perl handler for quick deployment into an Apache\n    environment.\n\n    Tmojo has proven useful in several of my company's commercial\n    projects, and, recently, a small number of developers outside of my\n    company have been effectively deploying Tmojo in their projects as\n    well. Having Tmojo listed on the module list would be a good step\n    toward wider distribution of what I hope will be a powerful tool for\n    the Perl community."
   },
   "meta" : {
      "message_id" : "200403270101.i2R117wH005154@pause.perl.org",
      "epoch" : 1080349267,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission HTML::Tmojo",
      "file" : "30055.txt",
      "type" : "module_submission"
   }
}
