{
   "data" : {
      "homepage" : "http://www.interunion.ca",
      "userid" : "INTMKTG",
      "fullname" : "Marc Tardif",
      "why" : "As an active member of the Montreal Perl Mongers, I have this\n    irresistible urge to share some of my Perl code. In the near future,\n    I expect to make a presentation on Hierarchical State Machines with\n    corresponding modules which would fit nicely under the existing\n    StateMachine namespace. This is the first module I expect to\n    contribute to CPAN.\n\n    I also have scripts which might be of interest but which I do not\n    expect to publish on http://www.cpan.org/scripts as of yet. The\n    reason is that I must really make sure there is an purpose for such\n    scripts before cluttering CPAN needlessly. Here is a brief overview\n    of some such scripts:\n\n    http://www.interunion.ca/src/symtab-0.1.tar.gz Tool for building\n    symbol tables in C. The code is written in Perl and XS, aiming to\n    create optimal tables from a static list of key/data pairs. Among\n    other algorithms, this tool can build minimal perfect hash tables.\n\n    http://www.interunion.ca/src/extractor-0.1.tar.gz Tool for\n    generating self extracting archives in /bin/sh or PHP. The code is\n    designed around the strategy pattern so that other languages can be\n    easily added. I'm currently working on adding JScript so that\n    Windows users don't feel left out.\n\n    (not available yet) Daemon to persist in memory programs written in\n    Perl and perhaps other extensible scripting languages eventually.\n    This uses the same idea as FastCGI but is not bounded to a web\n    context. Details will have to wait until I get something stable\n    working.\n\n    That's it for now, I hope you won't be too disappointed.",
      "mail" : "CENSORED"
   },
   "meta" : {
      "message_id" : "200403270308.i2R389fx006547@pause.perl.org",
      "epoch" : 1080356889,
      "from" : "upload@pause.perl.org",
      "subject" : "PAUSE ID request (INTMKTG; Marc Tardif)",
      "file" : "30062.txt",
      "type" : "pause_id_request"
   }
}
