{
   "data" : {
      "userid" : {
         "name" : "Andrew Schamp",
         "id" : "ASCHAMP"
      },
      "description" : "Search for book info by ISBN",
      "communities" : "",
      "chapterid" : {
         "name" : "World_Wide_Web_HTML_HTTP_CGI",
         "id" : "15"
      },
      "similar" : "Business::ISBN",
      "DSLIP" : "bdpOp",
      "modid" : "WWW::Scraper::ISBN",
      "enteredon" : "Mon Mar 29 18:43:37 2004 GMT",
      "enteredby" : {
         "name" : "Andrew Schamp",
         "id" : "ASCHAMP"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "This module (and associated modules, WWW::Scraper::ISBN::Driver and\n    WWW::Scraper::ISBN::Record) searches the internet for book\n    information (such as title, author, edition, etc.). This is usually\n    a challenge because there are no databases which have information\n    for all books. To solve this problem, a variety of drivers can be\n    written to search specific sites (currently, the Library of Congress\n    and ISBN.nu) for information. The main class handles the loading of\n    the desired drivers, which each inherit from the driver class, and\n    has a search method which methodically works through the drivers\n    until a match is found. Then it returns a Record type, which is a\n    simple data structure containing information about the book, that\n    the book was found, and errors.\n\n    These classes do no implement ISBN-specific functions like error\n    checking or interpreting country codes, publisher codes, etc., which\n    I believe are handled by Business::ISBN. There is also no formal\n    structure or very standard set of information to retrieve, as each\n    database may contain different fields for each book record. The idea\n    is to try and get a reasonable subset that will be useful.\n\n    The purpose behind this module is a textbook exchange website\n    operated by a CS organization at Calvin College."
   },
   "meta" : {
      "message_id" : "200403291843.i2TIhkrk023245@pause.perl.org",
      "epoch" : 1080585826,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission WWW::Scraper::ISBN",
      "file" : "30198.txt",
      "type" : "module_submission"
   }
}
