{
   "data" : {
      "userid" : {
         "name" : "Shumon Huque",
         "id" : "SHUQUE"
      },
      "Authen::Krb5:" : "either because it is not dependent on the",
      "description" : "Kerberos 5 Password Verification module",
      "communities" : "",
      "chapterid" : {
         "name" : "Security_and_Encryption",
         "id" : "14"
      },
      "similar" : "Authen::Krb5::Simple",
      "DSLIP" : "Sdcfp",
      "modid" : "Authen::Krb5Password",
      "enteredon" : "Fri Apr  9 23:06:11 2004 GMT",
      "enteredby" : {
         "name" : "Shumon Huque",
         "id" : "SHUQUE"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "I'd like to submit a module that performs Kerberos 5 password\n    verification. It has been in use at our site for a number of years\n    and I've recently given it out to a few colleagues so I thought I\n    might place it on CPAN also. There is one module on CPAN\n    (Authen::Krb5::Simple) that attempts to perform this function but\n    does so incompletely because it doesn't verify the authenticity of\n    the KDC's response (leaving it vulnerable to a well known attack.)\n\n    The module I intend to submit does the following: in addition to\n    acquiring initial credentials (ie. a Kerberos TGT), it obtains a\n    service ticket for a local application service and attempts to\n    decrypt the ticket via possession of it's master key - thus\n    verifying the authenticity of the Kerberos server's response.\n\n    It's a C extension module, requiring the MIT Kerberos 5 software\n    distribution to compile successfully.\n\n    The logical place for this module would be in the Authen::\n    hierarchy. And I'd like the name to be Authen::Krb5Password to make\n    it clear that this is a Kerberos password verification routine and\n    not native Kerberos authentication. I don't think it belongs in\n    Authen::Krb5:: either because it is not dependent on the\n    Authen::Krb5 module routines."
   },
   "meta" : {
      "message_id" : "200404092306.i39N6CVw020033@pause.perl.org",
      "epoch" : 1081551972,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Authen::Krb5Password",
      "file" : "30622.txt",
      "type" : "module_submission"
   }
}
