{
   "data" : {
      "userid" : {
         "name" : "Julian Mehnle",
         "id" : "JMEHNLE"
      },
      "description" : "A mail filter framework for the Courier MTA",
      "communities" : "Courier MTA users mailing list\n    <http://lists.sourceforge.net/lists/listinfo/courier-users>",
      "chapterid" : {
         "name" : "Mail_and_Usenet_News",
         "id" : "19"
      },
      "similar" : "",
      "DSLIP" : "RdpOp",
      "modid" : "Courier::Filter",
      "enteredon" : "Tue Apr 20 10:11:25 2004 GMT",
      "enteredby" : {
         "name" : "Julian Mehnle",
         "id" : "JMEHNLE"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "The Courier::Filter module is a purely Perl-based mail filter\n    framework for the Courier MTA <http://www.courier-mta.org>.\n\n    Courier supports an interface for mail filters (not unlike the\n    Sendmail Milter interface) to examine mail messages directly on\n    arrival, i.e. during the SMTP dialog, so messages can be rejected\n    outright without having to first accept them and later generate\n    concrete bounce messages. Courier::Filter implements this interface\n    and provides a very simple way for others to write filter modules.\n\n    In the tradition of widely used daemons such as Apache and Sendmail\n    having their own root-level namespace, I consider it appropriate to\n    grant the also widely used Courier MTA its own \"Courier\" root-level\n    namespace, for it doesn't collide with any other widely used\n    software.\n\n    Obviously, and due to the fact that Courier's documentation speaks\n    of its mail filter mechanism as \"courierfilter\", \"Courier::Filter\"\n    is a good namespace for this perl module and its belonging classes.\n\n    (Administrative note: I tried registering this module namespace in\n    the past, but got no response. I asked for help and advice on\n    <modules@perl.org> twice, but got no response. Maybe my requests got\n    lost?)"
   },
   "meta" : {
      "message_id" : "200404201011.i3KABRFs000306@pause.perl.org",
      "epoch" : 1082455887,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Courier::Filter",
      "file" : "30986.txt",
      "type" : "module_submission"
   }
}
