{
   "data" : {
      "userid" : {
         "name" : "Richard Michaud",
         "id" : "RMICHAUD"
      },
      "description" : "Standard-Perl",
      "communities" : "",
      "chapterid" : {
         "name" : "Miscellaneous_Modules",
         "id" : "23"
      },
      "similar" : "None known",
      "DSLIP" : "cdphp",
      "modid" : "Deploy",
      "enteredon" : "Sat Apr 24 04:47:53 2004 GMT",
      "enteredby" : {
         "name" : "Richard Michaud",
         "id" : "RMICHAUD"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "I in the initial development phases of creating a series of modules\n    under the Deploy root namespace. This namespace will be used for a\n    series of packages and extensions that enable developers and\n    implementors to deploy code and changes for testing, pilot and\n    production environments.\n\n    My thought process is to build a platform-independant deployment\n    framework that will allow for consistency across all phases of\n    development and environments with little or no coding involved. The\n    tools will contain module to handle deployment of simple files,\n    database changes, and hopefully backout procedures, along with other\n    ideas any developers might think of.\n\n    I've currently built a custom deployment framework for a company\n    I'm working for, but it still requires a great deal of reptitive\n    coding to handle things like database deployments or Windows NT\n    service implementation.\n\n    I will be utilizing a manifest-style mechanism where the individual\n    steps for a deployment will be specified in a text format. The\n    utility will then parse this file and \"run\" the deployment based\n    upon the entries in the file."
   },
   "meta" : {
      "message_id" : "200404240447.i3O4ltYk017811@pause.perl.org",
      "epoch" : 1082782075,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Deploy",
      "file" : "31154.txt",
      "type" : "module_submission"
   }
}
