{
   "data" : {
      "userid" : {
         "name" : "Tom Wyant",
         "id" : "WYANT"
      },
      "description" : "Change dates of Windows open files",
      "communities" : "ActiveState's Perl-Win32-Users",
      "chapterid" : {
         "name" : "Microsoft_Windows_Modules",
         "id" : "22"
      },
      "similar" : "Win32::FileTime",
      "DSLIP" : "adpfp",
      "modid" : "Win32API::File::Time",
      "enteredon" : "Mon May 24 13:52:08 2004 GMT",
      "enteredby" : {
         "name" : "Tom Wyant",
         "id" : "WYANT"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "This module was written because of a need to change the\n    modification date of an open file under Windows. The utime built-in\n    will not do this. The inline comments in win32_utime indicate a\n    desire to have utime be unable to change the dates on read-only\n    files, and the inability to change the date on an open file (even\n    one open read-only) appears to be a consequence of this.\n\n    I have found no other modules to change Windows file dates.\n    Win32::FileTime provides read-only access to the dates (via\n    Win32::API), but won't change them. The utime built-in will, but\n    with the restrictions mentioned above.\n\n    The proposed Win32API::File::Time module provides greater access to\n    modification and access time than any module I have found, and is\n    the only module that provides the ability to change the creation\n    time.\n\n    The top-level name (Win32API) was chosen because this module is\n    based on Win32::API. The rest was pretty well inevitable. I suppose\n    Win32API::File::Date was a possibility, but \"Time\" is consistent\n    with the underlying system API.\n\n    I have checked the module name list archive and found no proposals\n    for similar modules. A posting to ActiveState's Perl-Win32-Users\n    mailing list also came up dry."
   },
   "meta" : {
      "message_id" : "200405241352.i4ODq9lb005089@pause.perl.org",
      "epoch" : 1085406729,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Win32API::File::Time",
      "file" : "32208.txt",
      "type" : "module_submission"
   }
}
