{
   "data" : {
      "userid" : {
         "name" : "Eric Bohlman",
         "id" : "EBOHLMAN"
      },
      "description" : "Read or write XML data in PYX format via tie",
      "communities" : "comp.lang.perl.modules",
      "chapterid" : {
         "name" : "String_Lang_Text_Proc",
         "id" : "11"
      },
      "similar" : "XML::PYX",
      "DSLIP" : "bdphp",
      "modid" : "XML::TiePYX",
      "enteredon" : "Wed Jul  7 08:53:41 2004 GMT",
      "enteredby" : {
         "name" : "Eric Bohlman",
         "id" : "EBOHLMAN"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "There's already an XML::PYX module (written by Matt Sergeant)\n    available, so why another PYX implementation? Mainly because\n    XML::PYX is intended to be used in a standalone PYX-outputting\n    program which you open as a pipe. That works very well under Unix,\n    aside from the overhead of forking a separate process, but is\n    problematic on Win32 systems for a variety of niggling reasons: the\n    standalone script is supplied as a batch file, whose output can't be\n    properly redirected into a pipe unless you invoke it as 'perl\n    /perl/bin/pyx|' instead of just 'pyx|'. Both Win95 and Win98, as\n    well as possibly other Win32 systems, implement pipes using\n    temporary files and the reading process can't start reading until\n    the writing process is done writing, which means that if you're\n    parsing a huge file you may have to wait a long time before getting\n    *any* output. The ability to guarantee a single character data event\n    for any run of characters can often simplify processing. And\n    finally, when I wrote this the only supported namespace- aware way\n    to parse XML was the raw handlers interface of XML::Parser, which is\n    needlessly complicated for simple applications (there are, of\n    course, those who would argue that \"simple applications\" and\n    \"namespace-aware\" are mutually-exclusive categories)."
   },
   "meta" : {
      "message_id" : "200407070853.i678rjpx024274@pause.perl.org",
      "epoch" : 1089190425,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission XML::TiePYX",
      "file" : "33407.txt",
      "type" : "module_submission"
   }
}
