{
   "data" : {
      "userid" : {
         "name" : "Tristan Colombo",
         "id" : "BALDR"
      },
      "Summary" : "We present a Perl library dedicated to the analysis of",
      "description" : "Manipulation of graphs of biological data",
      "communities" : "",
      "chapterid" : {
         "name" : "Miscellaneous_Modules",
         "id" : "23"
      },
      "similar" : "Graph BioPerl",
      "DSLIP" : "bdpfp",
      "modid" : "BioGraph",
      "enteredon" : "Mon Jul 12 08:43:36 2004 GMT",
      "enteredby" : {
         "name" : "Tristan Colombo",
         "id" : "BALDR"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Summary: We present a Perl library dedicated to the analysis of\n    graphs representing biological data. It includes five different\n    types of operations : file access (reading and writting graphs in\n    different formats), basic operations (computing of values as well as\n    graph structure modification), random graph generator adapted to the\n    structure of graphs of biological data, an original clustering\n    method based on the identification of high density areas, and\n    finally a pathway towards visualization programs. Such a set of\n    functions provides a toolbox to study and manipulate graphs.\n\n    Many biological processes can be represented as a graph : protein\n    interactions, genes linked by an evolutionary relation, enzymatic\n    pathways, gene expression/regulation, etc. Such data are generally\n    associated to external information : for example, for a graph where\n    each vertex is a protein we would like to have access to its\n    function. Furthermore, the operations on such graphs are often the\n    same succession of calculations : the computing of a distance or a\n    density, the research of clusters, etc. That is the reason why we\n    have developped the BioGraph Perl module. This library makes it\n    possible to create imperative programs dedicated to graph treatment\n    (applicable on every type of graph and not only on biological data)\n    with input/output files compatible with many bioinformatics tools.\n    The programmer can use one of the graph representations or format\n    proposed in accordance with the type of operation needed.\n\n    An \"application note\" of this work has been submitted to\n    Bioinformatics."
   },
   "meta" : {
      "message_id" : "200407120843.i6C8hbC9001186@pause.perl.org",
      "epoch" : 1089621817,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission BioGraph",
      "file" : "33493.txt",
      "type" : "module_submission"
   }
}
