{
   "data" : {
      "userid" : {
         "name" : "Scott McCoy",
         "id" : "TAG"
      },
      "description" : "The Phrasebook Language",
      "communities" : "irc://efnet/perl irc://magnet/perl",
      "chapterid" : {
         "name" : "Language_Interfaces",
         "id" : "9"
      },
      "similar" : "",
      "DSLIP" : "bdphp",
      "modid" : "PBL",
      "enteredon" : "Sun Jul 25 05:39:37 2004 GMT",
      "enteredby" : {
         "name" : "Scott McCoy",
         "id" : "TAG"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "I really feel odd asking for a root namespace, however I am half\n    convinced its appropriate. This module set implements a language for\n    describing database interaction via code generation, which is\n    optionally runtime evaluated or written to static modules. It\n    enforces domain/range contracts to follow typing of SQL, and acts as\n    a meta-set of SQL.\n\n    Its an object oriented language, with classes, member data and\n    member functions. The functions however are not in the typical sense\n    of a function, as this is not a programming language exactly. For\n    instance, each \"function\" (actually named a query, respectively) can\n    have prepare and execute attributes but not multiple instances of\n    them since they are attributes and not calls.\n\n    It allows you to return complex datastructures rather than\n    statement handles, or even propigated instances of another\n    phrasebook object. I pasted a few examples on the freenode perl's\n    pastebot ( http://sial.org/pbot/3604 http://sial.org/pbot/3605\n    http://sial.org/pbot/3638 )\n\n    My logic for asking for a root namespace is that this is really an\n    entirely different module and I'm not really finding any namespace I\n    can classify it under. Its an entirely unique amongst all current\n    phrasebook approaches and quite unique in itself for a mediary\n    language in general.\n\n    Example of other things that have similar root namespaces: YAML POE\n    Alzaboo Mason\n\n    I think this deserves its own namespace far more than YAML does.\n    I'm not all about namespace pollution though, so if you can suggest\n    an alternative namespace that appropriately describes this module,\n    (Not DBIx:: blah -> I think thats far from appropriate) I will\n    gladly accept it.\n\n    Things included in this distribution: - A command line interface\n    compiler - A seperate parser for PBL-style languages - A package\n    which exports constants for the parser - A Rule package which\n    describes PBL itself - A DBI subclass for enforcing domain/range\n    contracts in non production-optimized environments - A Title class\n    for translating the PBL Parser output into Perl - A Core class for\n    interacting with all of the above and interface to dynamic runtime\n    translation/evaluation of PBL sources ... And likely more to come."
   },
   "meta" : {
      "message_id" : "200407250539.i6P5dbt7023085@pause.perl.org",
      "epoch" : 1090733977,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission PBL",
      "file" : "33749.txt",
      "type" : "module_submission"
   }
}
