{
   "data" : {
      "userid" : {
         "name" : "Michael B Stevens",
         "id" : "MBSTE"
      },
      "description" : "Build files from simpler files",
      "communities" : "perl.modules",
      "chapterid" : {
         "name" : "File_Names_Systems_Locking",
         "id" : "10"
      },
      "similar" : "none found -- perhaps a vague relation to File::Butler",
      "DSLIP" : "adpOg",
      "modid" : "File::MultiCat",
      "enteredon" : "Fri Jul 30 19:58:55 2004 GMT",
      "enteredby" : {
         "name" : "Michael B Stevens",
         "id" : "MBSTE"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "This module opens an input file. Each line of the file is parsed.\n    First files mentioned on each line are concatinated to make up the\n    last file mentioned on the line, and that file is written to disk.\n\n    The module is mainly used for preprocessing the pages of a website\n    when each page has common elements like menus, headers, and footers.\n    It differs from most preprocessing programs -- most use a macro\n    language. Instead, this module uses a single file which tells it how\n    to construct every page in the website from smaller text files.\n\n    A script based version (as opposed to this proposed module) can be\n    downloaded from:\n\n    http://www.mbstevens.com/preprocessor/index.html\n\n    It is the \"mcat.pl\" script from that download. The functionality of\n    the proposed module can be used in conjunction with other macro\n    based preprocessors.\n\n    Since the module can be used for any kind of construction of files\n    by concatination, I thought it best not to put it under html:: or\n    text::. I have also done a search under \"preprocessor\" and found\n    nothing that functions like this module -- all that I found perform\n    more like macro processors. I welcome suggestions.\n\n    Thanks, mbs"
   },
   "meta" : {
      "message_id" : "200407301958.i6UJwvNt015759@pause.perl.org",
      "epoch" : 1091217537,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission File::MultiCat",
      "file" : "33875.txt",
      "type" : "module_submission"
   }
}
