{
   "data" : {
      "userid" : {
         "name" : "Shaun Guth",
         "id" : "SHAUNGUTH"
      },
      "Interface:" : "namespace could benefit from using it at the top level.",
      "description" : "Add param()-style methods to your objects",
      "communities" : "irc.topgamers.net #topgamers",
      "chapterid" : {
         "name" : "Development_Support",
         "id" : "3"
      },
      "similar" : "Class::Virtual",
      "DSLIP" : "MdpOp",
      "modid" : "Interface::Param",
      "enteredon" : "Mon Aug  2 23:12:53 2004 GMT",
      "enteredby" : {
         "name" : "Shaun Guth",
         "id" : "SHAUNGUTH"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "There are no existing Interface:: classes on CPAN, but I think it\n    is a useful and needed namespace. These sets of classes are\n    generally abstract (or virtual) classes which define a particular\n    set of methods that subclasses should implement. This is\n    exceptionally useful when writing plugin-type objects which need to\n    have a consistent API even though they may have different\n    functionality.\n\n    Most of the time, these Interface definitions are included as a\n    custom part of the program being written; however, there are cases\n    for a general set of Interface:: objects. In particular is this one,\n    Interface::Param, which lets calling objects know that this class\n    supports a param() method which is expected to behave in a\n    particular way. Included will be the most commonly used subclass,\n    Interface::Param::Hash, which implements the interface by storing\n    and retrieving values from an in-memory hash.\n\n    Class::Virtual is related loosely in that it is an all-encompassing\n    module for these types of classes, and I think quite possibly the\n    Interface:: namespace could benefit from using it at the top level.\n\n    Of course, I'm open to suggestions about the naming, module,\n    design, code style, documentation, etc.\n\n    (PS, I don't know if this gets sent along using the form on\n    pause.perl.org, but the module is found at\n    http://cpan.org/authors/id/S/SH/SHAUNGUTH/Interface-Param-0.2.tar.bz2\n    (assuming the upload has gone through by the time you read this))"
   },
   "meta" : {
      "message_id" : "200408022313.i72ND3lD014301@pause.perl.org",
      "epoch" : 1091488383,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Interface::Param",
      "file" : "33919.txt",
      "type" : "module_submission"
   }
}
