{
   "data" : {
      "userid" : {
         "name" : "Jeffrey Cohen",
         "id" : "JCOHEN"
      },
      "description" : "extensible database with DBI and tie support",
      "communities" : "",
      "chapterid" : {
         "name" : "Database_Interfaces",
         "id" : "7"
      },
      "similar" : "SQL DBI",
      "DSLIP" : "adphg",
      "modid" : "Genezzo",
      "capabilities" : "support multiple users with locking and concurrency,",
      "enteredon" : "Fri Aug 13 05:04:34 2004 GMT",
      "enteredby" : {
         "name" : "Jeffrey Cohen",
         "id" : "JCOHEN"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Genezzo is extensible, embeddable database that supports a partial\n    DBI interface and tied hashes for persistent storage. It currently\n    supports a limited subset of SQL, but the alpha code already has\n    such nice features as indexes, constraints, and tablespace support\n    (ie a table, or even an individual row or column, can be split over\n    multiple datafiles on disk).\n\n    Jeff Zucker did something somewhat similar a couple years back -- a\n    sourceforge project called perldb which combined SQL::Parser and\n    DBD::RAM. It seems to be defunct.\n\n    I don't think it belongs under SQL::, because SQL is a particular\n    query language, and in principle, the underlying engine could\n    provide data storage and query execution support for multiple\n    languages, like XQuery/Xpath. I'd rather have parsers as plug-in\n    modules.\n\n    It's not really a good fit for DBI/DBD either, since it's not an\n    interface to a database, it's an actual database. Though to respect\n    that API there should be a DBI::Genezzo module with full DBI\n    support, versus the limited support in the prototype now.\n\n    It's a fairly large module right now (about 30K lines, 30+ files),\n    and it's not yet complete. The base version is just a\n    single-threaded, single user database, but I'd like to place under\n    packages under the namespace that you could download to extend its\n    capabilities: support multiple users with locking and concurrency,\n    transactions, replication, etc. Other modules might be user-defined\n    data types, index types, authentication and encryption.\n\n    Jeff Cohen"
   },
   "meta" : {
      "message_id" : "200408130504.i7D54bMi023686@pause.perl.org",
      "epoch" : 1092373477,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Genezzo",
      "file" : "34090.txt",
      "type" : "module_submission"
   }
}
