{
   "data" : {
      "userid" : {
         "name" : "William Ross",
         "id" : "WROSS"
      },
      "description" : "UK Postcode validation and location",
      "communities" : "various mailing lists, uk perl groups like london.pm, anyone else\n    who'll have it.",
      "chapterid" : {
         "name" : "Miscellaneous_Modules",
         "id" : "23"
      },
      "similar" : "Geo::Postalcode",
      "DSLIP" : "bdpOp",
      "modid" : "Geo::Postcode",
      "enteredon" : "Tue Aug 31 16:46:04 2004 GMT",
      "enteredby" : {
         "name" : "William Ross",
         "id" : "WROSS"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "There is no module for handling UK postcode data, and it's a very\n    common requirement. Geo::Postalcode provides similar tools for\n    working with US zipcodes, but they're very different and the UK\n    situation is complicated by the fact that postcode data isn't public\n    domain.\n\n    This module handles validation against the relevant British\n    Standard, parses postcodes into useful chunks, maps codes onto grid\n    references and latitude/longitudes, calculates distances between\n    places and comes with a basic set of about 3000 top-level locations\n    that lets one get started. It's designed to allow both quick and\n    dirty DWIM and easy subclassing, and it's fully documented and\n    tested.\n\n    I've taken care to minimise the footprint of the module, and the\n    interface for replacing the basic data set supplied is versatile and\n    should be very easy to use, but I'm sure both those areas will\n    benefit from a few more revisions over the next few weeks. It's\n    complete, in other words, but a bit of rough and tumble wouldn't\n    hurt :)\n\n    This development has been financially supported by Amnesty\n    International UK, but they are very happy for it to be publicly\n    released, as usual.\n\n    best\n\n    will"
   },
   "meta" : {
      "message_id" : "200408311646.i7VGk4sL006089@pause.perl.org",
      "epoch" : 1093970764,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Geo::Postcode",
      "file" : "34436.txt",
      "type" : "module_submission"
   }
}
