{
   "data" : {
      "userid" : {
         "name" : "James A. Pattie",
         "id" : "JAMESP"
      },
      "description" : "HTML Document Object",
      "communities" : "http://htmlobject.sf.net/",
      "chapterid" : {
         "name" : "World_Wide_Web_HTML_HTTP_CGI",
         "id" : "15"
      },
      "similar" : "CGI",
      "DSLIP" : "MdpOp",
      "modid" : "HTML::Object",
      "enteredon" : "Thu Oct  7 02:45:52 2004 GMT",
      "enteredby" : {
         "name" : "James A. Pattie",
         "id" : "JAMESP"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "This module started out as a private module for use in some apps\n    and then was open sourced about 3 years ago under the name\n    HTMLObject.\n\n    We would like to get it included in CPAN and thus are looking to\n    change the name to HTML::Object or an otherwise approved name that\n    still implies what the module provides.\n\n    This module provides the ability to define a complete HTML document\n    that is sent to the browser via cgi. I created the HTMLObject module\n    because the CGI module didn't allow us to create the document (in\n    any order we wanted - cookies, javascript, head, body, etc.) and\n    then decide to discard this document and create a different one,\n    based upon conditions while processing the users request.\n\n    Over time I have tried to implement many of the CGI like helpers so\n    that someone could potentially migrate from using CGI to the\n    HTMLObject and not feel too lost. It is not a drop-in replacement\n    and most of the functionality has been implemented as we needed\n    something for the projects we are creating.\n\n    To see some of the projects that use the current HTMLObject\n    implementation goto\n    http://htmlobject.sourceforge.net/cgi-bin/index.cgi?command=links&lang=en\n\n    I have done a CPAN search and did not find any modules claiming the\n    HTML::Object namespace directly and thus feel this is at least\n    available. All the modules would be HTML::Object::X and do not\n    actually derive from HTMLObject/HTML::Object.\n\n    Thank you for your consideration."
   },
   "meta" : {
      "message_id" : "200410070245.i972jvI2001344@pause.perl.org",
      "epoch" : 1097117158,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission HTML::Object",
      "file" : "35490.txt",
      "type" : "module_submission"
   }
}
