{
   "data" : {
      "userid" : {
         "name" : "Sean P. Quinlan",
         "id" : "SEANQ"
      },
      "description" : "Manage automated database backups",
      "communities" : "module-authors@perl.org",
      "chapterid" : {
         "name" : "Database_Interfaces",
         "id" : "7"
      },
      "similar" : "There are some modules to manage backing up files, but none for\n    backing up databases from live servers.",
      "DSLIP" : "ampOp",
      "modid" : "DBA::Backup",
      "enteredon" : "Fri Nov  5 20:40:50 2004 GMT",
      "enteredby" : {
         "name" : "Sean P. Quinlan",
         "id" : "SEANQ"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "I had developed a working module for managing automated backups of\n    databases on a MySQL server. I administer a number of MySQL database\n    on a few different servers for different clients. I wanted an\n    inexpensive way to robustly back up my databases. This solution used\n    the MySQL servers own tools to manage flushing logs, dumping\n    databases and such, and keeps a number of previouse backups in\n    rotation, not just of the databases but of the logs. Once on the\n    files system standard tools could, if desired, be used to move the\n    backups to tape, DVD, etc.\n\n    The module was originally named MySQL::Backup. I brought the module\n    up for discussion on the module authors list to see if placing it\n    under the MySQL namespace was appropriate and to get general\n    feedback about the module. I was moderately suprised at the level of\n    interest. Once I was convinced that reorganizing the module so that\n    others could use the same framework to write plugins to manage\n    backups of other server types and DBIx was ruled out as a root level\n    namespace, I brought up DBA:: as a possibility. Tim Bunce thought it\n    was an appropriate name space for cross-database DBA support\n    modules, and Christopher Hicks has generously supplied a mailing\n    list for it, perl-dba@fini.net.\n\n    Thanks, as always, Sean"
   },
   "meta" : {
      "message_id" : "200411052040.iA5KeoPZ008362@pause.perl.org",
      "epoch" : 1099687250,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission DBA::Backup",
      "file" : "36153.txt",
      "type" : "module_submission"
   }
}
