{
   "data" : {
      "userid" : {
         "name" : "Mark Winder",
         "id" : "MARKWIN"
      },
      "description" : "Profiles and cnc code for milling cogs",
      "communities" : "Unsure",
      "chapterid" : {
         "name" : "Not_Yet_In_Modulelist",
         "id" : "99"
      },
      "similar" : "I've looked but not found any similar functionality.",
      "DSLIP" : "cdpOg",
      "modid" : "CNC::Cog",
      "enteredon" : "Fri Dec 17 15:05:15 2004 GMT",
      "enteredby" : {
         "name" : "Mark Winder",
         "id" : "MARKWIN"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "People who make clocks and other mechanical mecanisms need to make\n    gears. The traditional methods of doing this involve having a large\n    set of different cutters in order to be able to make a full range of\n    gears. One alternative approach is to just cut the gear profile out\n    of a sheet of material using a small diameter circular milling\n    cutter. Although such an approach means that a few compromises must\n    be made in terms of shape (you cannot for example, cut a square\n    hole) in practice many useful gears can be cut.\n\n    This module aims to offer a number of functions for setting up\n    parameters of wheels and pairs of wheels and then offers the ability\n    of direct generation of G-code to be fed to a CNC milling machine.\n    It also currently use the GD module to plot out the same shapes for\n    test purposes. Its about generating cogs and traslating them into\n    metal.\n\n    There might and indeed ought to be other perl modules that generate\n    gcode for cnc metal and wood cutting machines. I've not found any\n    yet, but if there are others I think that CNC is a good prefix to\n    use. Its a new prefix, and I think is justified in this context. We\n    need to steer clear of Gcode as a different type of Gcode with an\n    entirely seperate meaning is used within the Perl interpreter I\n    believe!\n\n    So this module is (probably) to be called CNC::Cog and this seems\n    fairly self explanetary. There is also the concept of a cog-pair, a\n    pair of cogs with certain features in common which will mesh.\n\n    At the moment I have code that generates Epicycylic gears. This\n    will be uploaded shortly. Its structure needs more work, also there\n    are always more features needed, for example the ability to stack 2\n    or more gears on top of each other and cut them out of 1 piece of\n    metal. Other teeth shapes, not only Cycloidal but also saw-tooth has\n    aplications. Currently however it can sucessfully generate profiles\n    in Gcode, and display them using GD as jpegs.\n\n    I'd welcome email from anyone one intrested in this work or who has\n    been doing similar work."
   },
   "meta" : {
      "message_id" : "200412171505.iBHF5FxI004598@pause.perl.org",
      "epoch" : 1103295915,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission CNC::Cog",
      "file" : "37141.txt",
      "type" : "module_submission"
   }
}
