{
   "data" : {
      "userid" : {
         "name" : "Wes Hardaker",
         "id" : "HARDAKER"
      },
      "description" : "A system for running wizard screens",
      "communities" : "net-policy-users ATATA lists.sourceforge.net",
      "chapterid" : {
         "name" : "World_Wide_Web_HTML_HTTP_CGI",
         "id" : "15"
      },
      "similar" : "",
      "DSLIP" : "MmpOb",
      "modid" : "QWizard",
      "enteredon" : "Tue Feb  8 22:40:45 2005 GMT",
      "enteredby" : {
         "name" : "Wes Hardaker",
         "id" : "HARDAKER"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "This module has been long used within the net-policy project on\n    sourceforge but is independent of the rest of sourceforge, and thus\n    should be uploaded to CPAN (and preferrably listed in the module\n    list).\n\n    DESCRIPTION\n\n    The QWizard module allows script authors to concentrate on the\n    content of the forms they want their users to fill in without\n    worrying about the display. It allows \"Question Wizard\" like\n    interfaces to be very easily created and the results of the input\n    easily acted upon. Scripts written which are entirely based on\n    QWizard inputs are able to be run from the command line which will\n    show a Tk window or as a CGI script without modification. Script\n    writers do not need to know which interface is being used to display\n    the resulting form(s) as it should be transparent to the script\n    itself.\n\n    Other wizard interfaces exist for perl, but this one strives very\n    hard to be both extensible and easy to code with requiring as little\n    work by script authors as possible. It is also one of the only ones\n    that supports both web environments and windowing environments\n    without code modification required by the script author.\n\n    There are a few other wizard like modules within CPAN, but few are\n    in a polished state and don't offer the ease-of-programming use that\n    this one does. Most also don't support the multiple backends and are\n    targeted to single environments instead (ie, just the web). QWizard\n    is designed to make programming multiple-screen forms as easy and\n    possible and supports multiple backends (tk, Gtk2, html, readline,\n    WAP soon, and curses soon).\n\n    It doesn't fit under the hierarchy of the other standard top level\n    widgets because it itself is a self contained system that implements\n    stuff from multiple domains and the other hierarchies are more\n    targeted to a particular environment."
   },
   "meta" : {
      "message_id" : "200502082240.j18MelBQ005450@pause.perl.org",
      "epoch" : 1107902447,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission QWizard",
      "file" : "38243.txt",
      "type" : "module_submission"
   }
}
