{
   "data" : {
      "userid" : {
         "name" : "佐野 拓",
         "id" : "MIKAGE"
      },
      "description" : "Tripletail, a framework for Japanese Web App",
      "communities" : "Mailinglists",
      "chapterid" : {
         "name" : "World_Wide_Web_HTML_HTTP_CGI",
         "id" : "15"
      },
      "similar" : "Catalyst, CGI::Application, Jifty",
      "DSLIP" : "bmhOp",
      "modid" : "Tripletail",
      "enteredon" : "Sat Jul 22 04:23:53 2006 GMT",
      "enteredby" : {
         "name" : "佐野 拓",
         "id" : "MIKAGE"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "Tripletail is a framework for Web application.\n\n    In case of developing a software that work with Japanese, there are\n    often problems in treating character sets: There are several\n    different character sets for Japanese, and a software sometimes\n    needs to use some of them without being confused.\n\n    Tripletail works around to those problems which are specific to\n    Japanese, and provides many features that are needed to develop a\n    web site centers around web applications.\n\n    This framework mainly targets Web applications, but it also has\n    features for batch processing, mail manipulation, and the rest. So\n    we don't think CGI:: namespace is appropriate for Tripletail, we\n    desire the root one.\n\n    Some features like Debug Screen and DBI Wrapper can be used not\n    only for web applications, but also batch scripts. The debugging\n    utilities provide the following features:\n\n    - Send a mail containing stack trace to the administrator\n\n    - Profile the execution time of SQL statements\n\n    - Watch certain variables and log the content of them whenever they\n    change\n\n    In addition, Tripletail has the following features that are other\n    than CGI-related:\n\n    - Recognize Japanese holidays\n\n    - Create and parse mails in Japanese\n\n    - Turn a web page to HTML mail\n\n    - Sign a mail with S/MIME\n\n    - Process its own mail queue, and send mails using SMTP\n\n    These would be under Date:: or Mail:: if they were considered as\n    separate modules.\n\n    Web Site: http://tripletail.jp"
   },
   "meta" : {
      "message_id" : "200607220423.k6M4Nrk9011823@pause.perl.org",
      "epoch" : 1153542233,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Tripletail",
      "file" : "49968.txt",
      "type" : "module_submission"
   }
}
