{
   "data" : {
      "userid" : {
         "name" : "Roger A Hall",
         "id" : "ROGERHALL"
      },
      "description" : "AuthNZ via Roles, Groups, and Controllers",
      "communities" : "http://www.iosea.com/, http://bioinformatics.ualr.edu/",
      "chapterid" : {
         "name" : "World_Wide_Web_HTML_HTTP_CGI",
         "id" : "15"
      },
      "similar" : "none found in Catalystx; Catalyst tree includes a few smaller/core\n    options",
      "DSLIP" : "bdpOl",
      "modid" : "CatalystX::AuthNZ",
      "enteredon" : "Wed Nov 26 19:29:59 2008 GMT",
      "enteredby" : {
         "name" : "Roger A Hall",
         "id" : "ROGERHALL"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "AuthNZ is a complete package of Catalyst controllers and templates,\n    Class::Std-style user and application objects, and sql\n    initialization scripts to create a system for user authentication\n    and authorization. The included interfaces allow the admin to define\n    individual Catalyst controllers as either visible or invisible\n    resources which are grouped within applications (named after\n    Controller modules), enabling the system to generate personal\n    portals for all users, displaying only the links to which they have\n    access.\n\n    Access is controlled through a combination of \"application roles\",\n    \"application resources\", and \"user groups\". Application names become\n    navigation headers, and application resources are links (unless they\n    are marked \"not visible\"). The included methods for creating the\n    navigation sum all possible controllers for all of a given user’s\n    groups (which are mapped to the application roles, which are mapped\n    to the application resources.)\n\n    All data are managed within included Catalyst controllers (which\n    rely on included Perl6-style objects). A default \"Portal\"\n    application is pre-defined with standard portal features: login,\n    logout, password reset, manage profile, and home. An additional\n    \"Sample\" application is included with more examples, including\n    \"anonymous\" access and AJAX."
   },
   "meta" : {
      "message_id" : "200811261929.mAQJTx3P031772@pause.perl.org",
      "epoch" : 1227727799,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission CatalystX::AuthNZ",
      "file" : "63380.txt",
      "type" : "module_submission"
   }
}
