{
   "data" : {
      "userid" : {
         "name" : "Stanisław Klekot",
         "id" : "DOZZIE"
      },
      "description" : "collect facts about operating system",
      "communities" : "comp.lang.perl.modules",
      "chapterid" : {
         "name" : "Operating_System_Interfaces",
         "id" : "4"
      },
      "similar" : "Sys::Info Pfacter",
      "DSLIP" : "RdpOp",
      "modid" : "Sys::Facter",
      "enteredon" : "Tue Sep 25 07:52:53 2012 GMT",
      "enteredby" : {
         "name" : "Stanisław Klekot",
         "id" : "DOZZIE"
      },
      "PS" : "The following links are only valid for module list maintainers:",
      "rationale" : "The target users of Sys::Facter are sysadmins. Sys::Facter is\n    intended to provide them an easy-to-use infrastructure for detecting\n    various things (so called \"facts\"), like number of CPUs, amount of\n    RAM, partitions and LVM devices, NFS exports, SSH public keys,\n    occupied TCP/UDP ports and so on. Such data could be then collected\n    in a centralized place e.g. for keeping an inventory, used for\n    generating configuration files or to calculate server load for load\n    balancers. Some pre-defined modules would be available, but the most\n    important thing is that sysadmin could easily add his own \"facts\",\n    as a single developer can't think of every possible variable to be\n    detected.\n\n    While Sys::Info does a quite goot work in detecting parameters, it\n    can't easily be extended by user and hence it's not usable this way.\n    On the other hand, it could be used as a backend for Sys::Facter\n    plugins.\n\n    A good way would be to use Pfacter module. It provides a sensible\n    API for plugins that fits to above-mentioned usage. Unfortunately,\n    Pfacter practically doesn't have a usable documentation and its API\n    for building tools on top of it is horrible.\n\n    Sys::Facter utilizes Pfacter plugin API, while providing easier API\n    for tools and contains POD documentation for both interfaces."
   },
   "meta" : {
      "message_id" : "201209250752.q8P7qr4m021898@pause.fiz-chemie.de",
      "epoch" : 1348559573,
      "from" : "upload@pause.perl.org",
      "subject" : "Module submission Sys::Facter",
      "file" : "82414.txt",
      "type" : "module_submission"
   }
}
